{
    "intents": [
        {
            "tag": "gretting",
            "patterns": ["Bonjour", "Salut", "Bonsoir", "Ca va", "Hey", "Hello", "Bonne journée"],
            "responses": ["Bonjour, comment puis-je vous aider?", "Salut, comment ça va?", "Hello, comment puis-je vous aider?"]
        },
        {
            "tag": "goodbye",
            "patterns": ["Aurevoir", "Au revoir", "A bientot", "Bye", "A plus", "A la prochaine"],
            "responses": ["Aurevoir, a bientot!", "Au revoir, a bientot!", "A bientot, a bientot!"]
        },
        {
            "tag": "thanks",
            "patterns": ["Merci", "Merci beaucoup", "C'est utile", "Merci pour votre aide", "Merci pour m'avoir aidé"],
            "responses": ["De rien!", "Avec plaisir!", "Je vous en prie!", "N'hésitez pas à me demander!", "Y'a pas de quoi!"]        },
        {
            "tag": "noanswer",
            "patterns": [],
            "responses": ["Je suis un chatbot concu pour le diabète, pouvez-vous reformuler?", "Je ne comprends pas, pouvez-vous reformuler?", "Je n'ai pas compris, pouvez-vous reformuler?", "Je n'ai pas compris, pouvez-vous reformuler?"]        
        },
        {
            "tag": "options",
            "patterns": ["Comment pouvez-vous m'aider?", "Quels sont vos services?", "Que pouvez-vous faire?", "Qu'est ce tu sais faire?", "Que peux tu faire?"],
            "responses": ["Je peux vous aider à comprendre le diabète", "je peux vous donner des conseils sur le diabète", " je peux vous donner des informations sur le diabète", "Je peux vous aider à connaitre le diabète", "Je peux vous aider a comprendre le diabète", "Je peux vous aider a connaitre les symptomes du diabète"]        
        },
        {
            "tag": "about_diabetie",
            "patterns": ["Qu'est ce que le diabète?", "Connait tu le diabète?", "Peux tu m'expliquer le diabète?", "Explique moi le diabète", "C'est quoi le diabète?", "Parle moi du diabète?"],
            "responses": ["Le diabète est une maladie chronique qui ne se guérit pas, mais que l’on peut traiter et contrôler. Il est causé par un manque ou un défaut d’utilisation d’une hormone appelée insuline. L’insuline est produite par le pancréas. Elle permet au glucose (sucre) d’entrer dans les cellules du corps pour qu’il soit utilisé comme source d’énergie. Chez une personne non diabétique, l’insuline remplit bien son rôle et les cellules disposent de l’énergie dont elles ont besoin pour fonctionner. Lorsqu’il manque d’insuline ou qu’elle ne peut pas bien accomplir sa fonction, comme c’est le cas dans le diabète, le glucose ne peut pas servir de carburant aux cellules. Il s’accumule alors dans le sang et entraîne une augmentation du taux de sucre (hyperglycémie).", "Le diabète est une maladie chronique qui ne se guérit pas, mais qui se contrôle. Il est caractérisé par une glycémie, c’est-à-dire un taux de sucre dans le sang, au-dessus des valeurs normales. Habituellement, la glycémie est maintenue dans les valeurs normales grâce, entre autres, à l’insuline. L’insuline est une hormone produite par le pancréas. Elle agit comme une clé en permettant au sucre présent dans le sang d’entrer dans les cellules du corps pour qu’il soit utilisé comme source d’énergie.  En présence de diabète, l’un et/ou l’autre des phénomènes suivants se produisent :  Une résistance du corps à l’action de l’insuline; Une diminution ou une absence de production d’insuline.  Par conséquent, le sucre ne peut pas entrer dans les cellules et il s’accumule dans le sang, ce qui entraîne une hyperglycémie, c’est-à-dire une augmentation de la glycémie au-dessus des valeurs normales. À long terme, l’hyperglycémie peut mener au développement de certaines complications, notamment aux yeux, aux reins, aux nerfs, au cœur et aux vaisseaux sanguins. Il existe différents types de diabète, soit le prédiabète, le diabète de type 1, le diabète de type 2, le diabète de grossesse et d’autres types de diabète plus rares."]
        },
        {
            "tag": "complications",
            "patterns": ["Quels sont les complications du diabète?", "Quels sont les risques du diabète?", "Quels sont les problemes du diabète?", "Quels sont les effets du diabète?", "Quels sont les consequences du diabète?"],
            "responses": [
                "Les complications liées au diabète ont une origine commune : l’excédent de glucose dans le sang. Les complications du diabète peuvent modifier grandement la vie d’une personne diabétique. Un bon contrôle des glycémies permet de retarder et parfois même de limiter l’apparition des complications. À la longue, un taux de sucre élevé dans le sang entraîne certaines complications, notamment au niveau des yeux, des reins, des nerfs, du cœur et des vaisseaux sanguins. "]
        },
        {
            "tag": "symptoms",
            "patterns": ["Quels sont les symptomes du diabète?", "Comment savoir si j'ai le diabète?", "Comment savoir si je suis diabetique?", "Quels sont les signes du diabète?", "Quels sont les symptomes du diabète de type 1?", "Quels sont les symptomes du diabète de type 2?"],
            "responses": ["Si vous ressentez des symptômes de diabète, vous devrez faire une prise de sang, prescrite par un médecin ou une infirmière praticienne spécialisée (IPS). Il s’agit de la seule façon de confirmer un diagnostic de diabète.", "Les symptômes du diabète peuvent varier d’une personne à l’autre. Dans certains cas, le diabète peut même être présent sans que des symptômes ne soient perçus. Les symptômes suivants sont associés au diabète. Ils sont le reflet d’une hyperglycémie, c’est-à-dire un taux de sucre dans le sang au-dessus des valeurs normales. Les symptômes peuvent être présents ou non au moment du diagnostic de la maladie et peuvent également survenir lorsque le diabète n’est pas bien géré et qu’il y a une hyperglycémie. Dans bien des cas, les symptômes du diabète de type 2 sont tellement mineurs qu’ils peuvent passer inaperçus pendant plusieurs années. Pendant ce temps, la maladie poursuit son évolution. Il est donc important de passer des prises de sang régulièrement à partir de l’âge de 40 ans.           Symptômes de l’hyperglycémie:  Fatigue Somnolence Augmentation du volume et de la fréquence des urines Soif intense Bouche sèche Irritabilité Difficulté de concentration  Si l’hyperglycémie se maintient dans le temps, les symptômes suivants peuvent s’installer:  Vision embrouillée Faim exagérée Perte de poids inexpliquée Plaies qui guérissent mal Infection des organes génitaux et de la vessie    Le diabète ne se manifeste pas toujours de la même façon, avec la même intensité et en présence de tous ces symptômes. Il arrive même que les symptômes passent inaperçus durant plusieurs années. Consultez un médecin si un ou plusieurs symptômes sont présents. Une prise de sang permettra de confirmer si ces symptômes sont le résultat d’une hyperglycémie. Si les symptômes sont importants, rendez-vous à l’hôpital.     Diabète de type 1 Les symptômes du diabète de type 1 peuvent apparaître progressivement ou subitement, selon le cas. Aux symptômes listés ci-dessus peuvent s’ajouter :  Crampes abdominales Haleine fruitée, en raison de la présence de corps cétoniques dans le sang ou dans l’urine  Prédiabète Il y a rarement des symptômes en présence de prédiabète."]
        },
        {
            "tag": "types_of_diabetie",
            "patterns": ["Quels sont les types de diabète?", "Quels sont les formes de diabète?", "Quels sont les categories de diabète?", "Quels sont les genres de diabète?", "Quels sont les sortes de diabète?"],
            "responses": ["Il existe plusieurs types de diabète, soit le prédiabète, le diabète de type 1, le diabète de type 2, le diabète de grossesse et d’autres types de diabète plus rares.\nLe diabète de type 1 Le diabète de type 1 se manifeste à l’enfance, à l’adolescence et chez les jeunes adultes. Environ 10 % des cas de diabète sont de type 1. Il se caractérise par l’absence totale de la production d’insuline. Pour une raison encore inconnue, les cellules qui produisent l’insuline sont détruites par le système immunitaire. Ne fabriquant plus d’insuline, les personnes diabétiques de type 1 dépendent d’injections quotidiennes d’insuline pour vivre. Le diabète de type 2 Le diabète de type 2 se manifeste plus tard dans la vie, généralement vers l’âge de 40 ans. La très grande majorité des personnes atteintes de diabète ont ce type de diabète, environ 90 % des cas. Mais depuis quelques années, un phénomène inquiétant se manifeste : on remarque que ce diabète apparaît de plus en plus tôt et, chez certaines populations à risque, il peut apparaître dès l’enfance. Chez certaines personnes, la production d’insuline est insuffisante. Chez d’autres, l’insuline sécrétée n’accomplit pas son travail adéquatement, entraînant l’augmentation du taux de sucre dans le sang. Le diabète de grossesse Le diabète de grossesse se manifeste pendant la grossesse, généralement vers la fin du 2e et au 3e trimestre. Il est aussi connu sous le nom de diabète gestationnel. On retrouve un diabète gestationnel chez 3 à 20% des femmes enceintes. Dans 80 % des cas, il disparaîtra 3 à 6 mois après l’accouchement. Il affecte à la fois le bébé et la mère. Chez l’enfant, il y a un risque qu’il soit plus gros que la normale. Chez la mère, la présence du diabète accroît les risques d’infections, augmente le niveau de fatigue et peut causer des complications lors de l’accouchement. Les femmes ayant fait un diabète gestationnel sont plus à risque de développer le diabète plus tard"]
        },
        {
            "tag": "risk",
            "patterns": ["Quels sont les facteurs de risque pour le diabète", "Comment sont les facteurs de risque pour le diabète?", "Comment les personnes de 40 ans et plus ont des facteurs de risque pour le diabète?"],
            "responses": ["Les causes du diabète de type 2 sont nombreuses et, dans bien des cas, c’est la combinaison de plusieurs facteurs qui entraîne l’apparition de la maladie. Par exemple:  Le sexe : les hommes sont plus vulnérables que les femmes; L’âge : 40 ans et plus; L’hérédité : avoir un parent du premier degré (parent, frère, sœur, enfant) qui vit avec le diabète de type 2; L’origine ethnique : autochtone, africaine, asiatique, hispanique, arabe ou sud-asiatique; Le surplus de poids; Le tour de taille élevé, soit la graisse accumulée autour de l’abdomen; La sédentarité; Les mauvaises habitudes alimentaires: comme manger peu ou pas de fruits et légumes; Le tabagisme; L’hypertension artérielle; La présence de maladies associées: pancréatite, infection par le VIH, troubles psychiatriques (schizophrénie, dépression, trouble bipolaire), syndrome des ovaires polykystiques, la goutte (hyperuricémie); La prise de médicaments associés au diabète: glucocorticoïdes (cortisone), médicaments anti-rejet, antipsychotiques atypiques, statines; Des résultats de glycémie anormalement élevés dans le passé; Pour les femmes, avoir donné naissance à un bébé de plus de 4,1 kg (9 livres); Des antécédents de diabète gestationnel; Un faible niveau de scolarité.  Certains facteurs de risque ne peuvent être changés.  Il est toutefois possible de réduire son risque de développer une diabète de type 2 en agissant sur certains facteurs de risque, comme les habitudes alimentaires, l’activité physique et le tabagisme.   Suis-je à risque ? (faites le test)     Étape 1 de 12   8%   Êtes-vous un homme ou une femme?Êtes-vous un homme ou une femme?(Nécessaire)   Homme    Femme    Suivant     Quel âge avez-vous ?Quel âge avez-vous?(Nécessaire)   Précédent Suivant     Quels sont votre poids et votre taille ?Entrez votre poids(Nécessaire)Unités(Nécessaire)LivresKgEntrez votre taille(Nécessaire)   Pieds    Pouces  Entrez votre taille(Nécessaire)Unités(Nécessaire)Pieds et poucesCentimètres   Précédent Suivant     Quel est votre tour de taille ?À l’aide d’un ruban à mesurer, mesurez votre tour de taille à la hauteur du nombril. Expirez, (ne retenez pas votre souffle) puis prenez la mesure. (Remarque : cela n’a rien à voir avec la taille de vos pantalons.)Tour de tailles(Nécessaire)Unités(Nécessaire)CentimètresPouces   Précédent Suivant     Faites-vous habituellement de l'activité physique, comme de la marche rapide, au moins 30 minutes par jour ?Activités(Nécessaire)   Oui    Non    Précédent Suivant     À quelle fréquence mangez-vous des légumes ou des fruits ?Fruits et légumes(Nécessaire)   Tous les jours    Pas tous les jours    Précédent Suivant     Un médecin ou un membre du personnel infirmier vous a-t-il déjà dit que vous faisiez de l'hypertension artérielle OU avez-vous déjà pris des médicaments contre l’hypertension artérielle ?Hypertension(Nécessaire)   Oui    Non ou ne sais pas    Précédent Suivant     Avez-vous déjà eu un résultat de glycémie élevée lors d’une analyse sanguine, d’une maladie ou d’une grossesse ?Glycémie(Nécessaire)   Oui    Non    Précédent Suivant     Avez-vous déjà donné naissance à un bébé de 9 livres (4,1 kg) ou plus ?Bébé(Nécessaire)   Oui    Non / Ne sais pas    Précédent Suivant     Est-ce qu’un membre de votre famille a déjà eu un diagnostic de diabète ?Génétique(Nécessaire)   Oui    Non Si oui, veuillez choisir :(Nécessaire)  Mère   Père   Enfants   Frère(s) et/ou sœur(s)   Autres    Précédent Suivant     Quel est le groupe ethnique de vos parents biologiques ?Mère(Nécessaire)Blanc (type caucasien)AutochtoneNoir (Afro-Antillais)Asiatique de l'Est (Chinois, Vietnamien, Coréen, etc.)Asiatique du Sud (Indien-Oriental, Pakistanais, etc.)Autres(Latino-Américain, Arabe, Asie occidentale. etc)Père(Nécessaire)Blanc (type caucasien)AutochtoneNoir (Afro-Antillais)Asiatique de l'Est (Chinois, Vietnamien, Coréen, etc.)Asiatique du Sud (Indien-Oriental, Pakistanais, etc.)Autres(Latino-Américain, Arabe, Asie occidentale. etc)   Précédent Suivant     Quel est le plus haut niveau de scolarité que vous ayez atteint ?Scolarité(Nécessaire)   Études secondaires ou moins    Diplôme d’études secondaires    Études collégiales ou universitaires    Diplôme d’études collégiales ou universitaires  Précédent Envoyer             Δ   Des ressources pour vous aider Documents  Comprendre et prévenir le diabète de type 2 (dépliant disponible dans la boutique) Le tabagisme et le diabète (dépliant disponible dans la boutique) En forme chez soi 1 (dépliant disponible dans la boutique)   Recherche et rédaction: Équipe de professionnelles de la santé de Diabète Québec Juillet 2023"]
        },
        {
            "tag": "treatment",
            "patterns": ["Comment traiter le diabète", "Comment faire le traitement", "Comment se soigner du diabète", "Comment traite-t-on le diabète ?"],
            "responses": ["Il existe plusieurs approches de traitement pour le diabète, l’objectif à atteindre est un meilleur contrôle des glycémies. Le traitement du diabète comprend : Dans bien des cas, le diabète de type 2 peut être contrôlé en modifiant les habitudes alimentaires et en faisant plus d’activité physique. Quelque soit le type de diabète, l’enseignement est la base du traitement. Offert par une équipe de professionnels de la santé, la personne diabétique apprend ce qu’est la maladie, comment la contrôler, de quelle manière s’alimenter et comment intégrer l’activité physique de façon sécuritaire. Elle apprend également à faire des mesures quotidiennes des glycémies et à s’injecter d’insuline lorsqu’elle est prescrite."]
        },
        {
            "tag": "prevention",
            "patterns": ["Comment prevenir le diabète?", "Comment eviter le diabète?", "Peut-on prévenir le diabète ?"],
            "responses": ["On peut prévenir le diabète de type 2  ou en retarder l’apparition en modifiant ses habitudes de vie. Faites le test pour savoir si vous êtes à risque."]
        },
        {
            "tag": "advises",
            "patterns": ["Est-ce que le diabète se guérit ?", "Peut-on se guérire du diabète"],
            "responses": ["Le diabète est une maladie chronique incurable. Par contre, il est possible de le contrôler."]
        },
        {
            "tag": "type_2",
            "patterns": ["Qu'est-ce que le diabète de type 2", "Parle moi du diabète de type 2"],
            "responses": ["Le diabète de type 2 est une maladie chronique incurable qui se caractérise par une insuffisance rénale chronique, une hyperglycémie et une insuffisance hépatique. Le diabète de type 2 peut être décomposé en deux types: le diabète insulinodépendant et le diabète juveniles", "Le diabète de type 2 est la forme la plus fréquente de diabète, avec 90 % des cas. Il se manifeste généralement à l’âge adulte, chez les individus de 40 ans et plus. Malheureusement, on constate qu’il apparaît également chez des personnes de plus en plus jeunes, en raison entre autres de l’augmentation du taux d’obésité. Dans les populations à risque, il peut même apparaître dès l’enfance.   Dans le diabète de type 2, deux phénomènes sont généralement présents :  une résistance du corps à l’action de l’insuline; une diminution de la production d’insuline.  S’en suit une hyperglycémie, c’est-à-dire une augmentation du taux de sucre dans le sang au-dessus des valeurs normales. À long terme, l’hyperglycémie peut mener au développement de certaines complications, notamment aux yeux, aux reins, aux nerfs, au cœur et aux vaisseaux sanguins. Des symptômes peuvent être présents ou non au moment du diagnostic.     Vidéo: Qu’est-ce que le diabète de type 2?        Les facteurs de risques Les causes du diabète de type 2 sont nombreuses et, dans bien des cas, c’est la combinaison de plusieurs facteurs qui entraîne l’apparition de la maladie. Par exemple:  Le sexe : les hommes sont plus vulnérables que les femmes; L’âge : le risque augmente à mesure que l’on vieillit; Le surplus de poids; Le tour de taille élevé, soit la graisse accumulée autour de l’abdomen; La sédentarité ; Les mauvaises habitudes alimentaires; L’hypertension artérielle; Des résultats de glycémie anormalement élevés dans le passé; Pour les femmes, avoir donné naissance à un bébé de plus de 4,1 kg (9 livres); L’hérédité; L’origine ethnique : autochtone, africaine, asiatique, latino-américaine, etc. Un faible niveau de scolarité.    Le diagnostic du diabète de type 2 Seule une prise de sang analysée en laboratoire permet de poser un diagnostic de diabète.  Le tableau ci-dessous indique les valeurs diagnostiques pour le prédiabète et le diabète qui proviennent des Lignes directrices de pratique clinique 2018 pour la prévention et le traitement du diabète au Canada de Diabète Canada: PrédiabèteDiabète de type 2Glycémie à jeun (glycémie AC)Entre 6,1 et 6,9 mmol/L (anomalie de la glycémie à jeun)7,0 mmol/L et plusHémoglobine glyquée (HbA1c ou A1c)Entre 6,0 et 6,4 %6,5 % et plusGlycémie 2 heures après avoir bu un liquide contenant 75 g de glucose (hyperglycémie provoquée par voie orale ou HGPO)Entre 7,8 et 11,0 mmol/L (intolérance au glucose)11,1 mmol/L et plusGlycémie mesurée à tout moment de la journée–11,1 mmol/L et plus, avec les symptômes classiques Parfois, une deuxième prise de sang est nécessaire afin de confirmer les résultats obtenus. La prévention Bonne nouvelle! Il est démontré que la modification des habitudes de vie peut diminuer de près de 60% le risque de développer le diabète de type 2, ou du moins en retarder l’apparition, ainsi que les complications associées. Pour connaître votre niveau de risque de développer le diabète de type 2.  À voir aussi       Lire plus     Qu'est-ce que le diabète ?           Lire plus     Diabète de type 2: Enfants et adolescents         Des ressources pour vous aider Documents Diabète Québec  Comprendre et prévenir le diabète de type 2  Ressources externes  ADA   Recherche et rédaction: Équipe de professionnelles de la santé de Diabète Québec © Diabète Québec – Juillet 2022 Références Ékoé J, Goldenberg R, Katz P. Diabetes Canada 2018 Clinical Practice Guidelines for the Prevention and Management of Diabetes in Canada: Screening for Diabetes in Adults. Can J Diabetes 2018;42(Suppl 1):S16-S19. Punthakee Z, Goldenberg R and Katz P. Diabetes Canada 2018 Clinical Practice Guidelines for the Prevention and Management of Diabetes in Canada: Definition, Classification and Diagnosis of Diabetes, Prediabetes and Metabolic Syndrome. Can J Diabetes 2018; 42 (Suppl 1): S10-S15. Diabetes Prevention Program Research Group, Knowler WC, Fowler SE, et al. 10-year follow-up of diabetes incidence and weight loss in the Diabetes Prevention Program Outcomes Study. Lancet. 2009;374:1677-1686."]
        },
        {
            "tag": "type_1",
            "patterns": ["Qu'est-ce que le diabète de type 1", "Parle moi du diabète de type 1"],
            "responses": ["Le diabète de type 1 est une maladie chronique incurable qui se caractérise par une insuffisance rénale chronique, une hyperglycémie et une insuffisance hépatique. Le diabète de type 1 est la cause la plus fréquente des diabètes de type 2 et les facteurs de risque les plus importants", "Ce type de diabète apparaît généralement chez les personnes de moins de 20 ans. Il touche environ 10 % des personnes vivant avec le diabète. Le diabète de type 1 était autrefois appelé diabète insulinodépendant ou diabète juvénile. Il se caractérise par l’absence totale de production d’insuline. La personne vivant avec le diabète de type 1 dépend donc d’injections quotidiennes d’insuline ou d’une pompe à insuline pour assurer sa survie.         Les causes Les causes exactes de l’apparition du diabète de type 1 demeurent inconnues. Dans la majorité des cas, les cellules qui produisent l’insuline (cellules bêta), situées dans le pancréas, sont détruites par le système immunitaire. Le processus de destruction évolue habituellement sur plusieurs années. Il débute bien avant l’apparition des premiers symptômes de la maladie. On ne sait pas ce qui déclenche cette attaque ni pourquoi elle débute. Les chercheurs pensent qu’une prédisposition génétique et certains facteurs liés à l’environnement contribuent au développement du diabète de type 1.   Qu’est-ce que le diabète de type 1?   Les symptômes Lorsque le diabète de type 1 se développe, certains symptômes apparaissent tels que:  Une soif intense De la fatigue Des urines fréquentes Une perte de poids Une vision embrouillée.  Sans traitement, ces symptômes peuvent évoluer et mener à une acidocétose diabétique. Le diagnostic du diabète de type 1 Seule une prise de sang analysée en laboratoire permet de diagnostiquer le diabète de type 1. On mesure la glycémie, c’est-à-dire le taux de sucre dans le sang. Le tableau ci-dessous indique les valeurs diagnostiques pour le prédiabète et le diabète qui proviennent des Lignes directrices de pratique clinique 2018 pour la prévention et le traitement du diabète au Canada de Diabète Canada: Glycémie à jeun7 mol/L et plusGlycémie à tout moment de la journée11,1 mmol/L et plusAvec les symptômes du diabète Dans certains cas, un dosage des anticorps anti GAD65 est fait pour confirmer le type de diabète. Leur présence signale la forte probabilité d’un diabète de type 1. Cette mesure est complétée au besoin par le dosage du peptide-C qui reflète la quantité d’insuline que le pancréas est capable de produire. De plus, des symptômes sont pratiquement toujours présents au moment du diagnostic. Le phénomène de la « lune de miel » Peu de temps après le diagnostic de diabète de type 1, certaines personnes vivront ce qu’on appelle le phénomène de la « lune de miel ». Cette période transitoire est marquée par une diminution importante des besoins en insuline.  Elle dure en moyenne de six à neuf mois, mais peut durer jusqu’à deux ans. Ce phénomène s’explique par la sécrétion d’une certaine quantité d’insuline par quelques cellules du pancréas encore saines. Éventuellement, le processus auto-immun propre au diabète de type 1 conduira à la destruction complète de ces cellules. En l’absence totale de sécrétion d’insuline, les glycémies seront plus élevées et les doses d’injection d’insuline devront être augmentées.  Des ressources pour vous aider Documents  Protocole d’intervention en milieu scolaires pour les élèves atteints de diabète de type 1  Ressources externes  Projet BETTER FRED: Fondation Ressource pour les Enfants Diabétiques   Recherche et rédaction : Équipe des professionnelles de la santé de Diabète Québec Juillet 2022 © Diabète Québec Références : Punthakee Z, Goldenberg R and Katz P. Diabetes Canada 2018 Clinical Practice Guidelines for the Prevention and Management of Diabetes in Canada: Definition, Classification and Diagnosis of Diabetes, Prediabetes and Metabolic Syndrome. Can J Diabetes 2018; 42 (Suppl 1): S10-S15."]
        },
        {
            "tag": "type_1_vs_type_2",
            "patterns": ["Quelle est la différence entre un diabète de type 1 et un diabète de type 2?"],
            "responses": ["Le diabète de type 1 est une maladie auto-immune. Les injections d’insuline sont le seul traitement du diabète de type 1.  Les habitudes de vie, la génétique et d’autres facteurs sont généralement ce qui mènent au développement d’un diabète de type 2. Il peut se traiter par un changements des habitudes de vie et par des médicaments."]
        },
        {
            "tag": "prediabetie_vs_type_2",
            "patterns": ["Est-ce qu'un prédiabète mène toujours à un diabète de type 2?"],
            "responses": ["Souvent, mais pas toujours. En modifiant ses habitudes de vie, il est possible de freiner ou de ralentir l’évolution du prédiabète vers un diabète de type 2. "]
        },
        {
            "tag": "prohibited_foods",
            "patterns": ["Quels sont les aliments interdits quand on a le diabète?"],
            "responses": ["Aucun aliment n’est interdit. Cependant, certains aliments devraient être consommés de façon occasionnelle et en petite quantité, par exemple, les gâteaux, les biscuits, les bonbons, etc. L’important lorsqu’on fait le choix de manger un dessert sucré, c’est de s’assurer qu’il fasse partie d’un repas équilibré."]
        },
        {
            "tag": "occurence_hypoglycemia",
            "patterns": ["Quoi faire quand on a une hypoglycémie?"],
            "responses": ["Une hypoglycémie légère devrait être traitée avec 15 grammes de sucre à absorption rapide."]
        },
        {
            "tag": "occurence_hyperglycemia",
            "patterns": ["Quoi faire quand on a une hyperglycémie?"],
            "responses": ["Pour les personnes vivant avec le diabète de type 1, il est possible de s’administrer une dose d’insuline de correction, aussi appelé bolus de correction, selon les directives de son équipe traitante. Pour une personne vivant avec le diabète de type 2, plusieurs stratégies peuvent être mises en place. L’hypoglycémie peut même survenir jusqu’à 24 heures plus tard!Le glucagon ne pourra pas corriger une hypoglycémie causée par une prise d’alcool excessive.Les symptômes de l’hypoglycémie peuvent ressembler aux symptômes d’ivresse."]
        },
        {
            "tag": "advises",
            "patterns": ["Est-ce que le diabète se guérit ?", "Peut-on se guérire du diabète"],
            "responses": ["Le diabète est une maladie chronique incurable. Par contre, il est possible de le contrôler."]
        },
        {
            "tag": "subtitue_of_sugar",
            "patterns": ["Les substituts de sucre sont-ils de bons choix pour remplacer le sucre blanc?"],
            "responses": ["La consommation de substituts de sucre devrait être occasionnelle et modérée. "]
        },
        {
            "tag": "desserts",
            "patterns": ["Quels desserts puis-je manger?"],
            "responses": ["Aucun dessert n’est interdit. Cependant, certains desserts devraient être consommés de façon occasionnelle et en petite quantité. Il est aussi préférable de choisir des fruits, par exemple, qu’un dessert transformé. Si vous cuisinez vos desserts, vous pouvez réduire la quantité de sucre de la recette."]
        },
        {
            "tag": "ketogenic_diet",
            "patterns": ["Qu'est-ce que la diète cétogène?"],
            "responses": ["La diète cétogène, aussi appelée diète kéto, consiste à manger peu ou pas de glucides."]
        },
        {
            "tag": "intermittent_fasting",
            "patterns": ["Qu'est-ce que le jeûne intermittent?"],
            "responses": ["Le jeûne intermittent consiste à manger durant une période de temps précise dans la journée.  Si vous décidez d’entreprendre un jeûne intermittent, parlez-en à votre équipe traitante. Des ajustements dans vos doses médicaments pourraient être nécessaires."]
        },
        {
            "tag": "taking_insulin",
            "patterns": ["Puis-je prendre mon insuline et mes médicaments avant une prise de sang?"],
            "responses": ["Lorsque vous vous rendez à l’hôpital pour des prises de sang à jeun, vous ne devez pas prendre votre insuline à action rapide ou à courte durée d’action, ni votre médication antihyperglycémiante. La première raison pour laquelle vous ne devez pas le faire, est que l’insuline injectée alors que vous êtes à jeun abaisserait votre glycémie et vous pourriez vous retrouver en hypoglycémie. La deuxième raison, est que l’interprétation des résultats de la prise de sang, et donc de votre contrôle glycémique, serait faussée et difficile à faire puisque l’insuline aurait déjà commencé à agir au moment du prélèvement. Il est suggéré de prendre votre rendez-vous le plus tôt possible le matin et, une fois votre prise de sang terminée, de vérifier votre glycémie puis de prendre votre injection ou votre médication antihyperglycémiante et votre déjeuner. Lorsque vous injectez votre insuline, vous devez manger dans les minutes qui suivent l’injection. Si cette consigne n’est pas respectée, vous courez le risque de vous retrouver en hypoglycémie. Recherche et rédaction: Équipe de professionnelles de la santé de Diabète Québec Adapté de : Tremblay L., Infirmière, (Printemps 2001) Prise de sang : Quand prendre son insuline."]
        },
        {
            "tag": "giving_blood",
            "patterns": ["Puis-je donner du sang?"],
            "responses": ["Le 4 décembre 2023, les critères d’éligibilité au don de sang ont été assouplis pour personnes vivant avec le diabète.  Toutes les personnes vivant avec le diabète de type 2 géré par les habitudes de vie ou les médicaments par la bouche ou intramusculaire sont éligibles au don de sang. Si vous vivez avec le diabète de type 1 ou 2 et que vous prenez de l’insuline, les critères suivants doivent être respectés : Si vous désirez plus de détails sur les critères de qualification des donneurs, nous vous suggérons de consulter l’article sur les assouplissement des critères sur le site Internet d’Héma-Québec ou de communiquer avec eux. Recherche et rédaction : Équipe de professionnels de la santé de Diabète Québec © Diabète Québec – Janvier 2024. Références: Héma-Québec. (2023). Assouplissement des critères d’admissibilité. https://www.hema-quebec.qc.ca/assouplissements-creutzfeldt-jakob-diabete.fr.html Lettre de Nathalie Fagnan, CPA, IAS.A, Présidente et chef de la direction Héma-Québec, le 8 novembre 2023"]
        },
        {
            "tag": "tatoo",
            "patterns": ["Puis-je me faire tatouer?", "Est ce que je peut faire du tatouage", "Tatouage"],
            "responses": ["Oui. Cependant, il est préférable que le diabète soit bien géré, c’est-à-dire que l’hémoglobine glyquée (A1C) et les valeurs d’autosurveillance de la glycémie capillaire soient dans les valeurs cibles. Certaines zones du corps sont également à éviter.", "Une personne diabétique peut se faire tatouer en prenant quelques précautions. En plus des conseils d’usage concernant les règles d’hygiène* qui s’appliquent à tous, diabétiques ou non, il est important d’avoir un contrôle optimal de sa glycémie avant de se faire tatouer. L’importance d’être bien préparé Un contrôle non optimal peut retarder la guérison et augmenter le risque d’infection. Il vaut souvent mieux de retarder le moment du tatouage que de risquer des complications suite au tatouage. Par contrôle optimal, on entend :  Hémoglobine glyquée de 7 % ou moins Glycémie à jeun et avant les repas entre 4,0 et 7,0 mmol/L Glycémie après les repas entre 5,0 et 10,0 mmol/L  La glycémie peut s’élever lorsque vous vous faites tatouer. Elle revient généralement à la normale le lendemain. Les zones à éviter Certaines régions du corps, particulièrement celles où la circulation se fait moins bien (tibia, chevilles, pieds), de même que les régions d’injection de l’insuline (abdomen, cuisse, fesses, bras), devraient être évitées, car la guérison peut être plus lente *Vous pouvez consulter le document Tatouage et piercing sur le site web du ministère de la Santé et des Services sociaux"]
        },
        {
            "tag": "risk",
            "patterns": ["Quels sont les facteurs de risque pour le diabète", "Comment sont les facteurs de risque pour le diabète?", "Comment les personnes de 40 ans et plus ont des facteurs de risque pour le diabète?"],
            "responses": ["Les causes du diabète de type 2 sont nombreuses et, dans bien des cas, c’est la combinaison de plusieurs facteurs qui entraîne l’apparition de la maladie. Par exemple:  Le sexe : les hommes sont plus vulnérables que les femmes; L’âge : 40 ans et plus; L’hérédité : avoir un parent du premier degré (parent, frère, sœur, enfant) qui vit avec le diabète de type 2; L’origine ethnique : autochtone, africaine, asiatique, hispanique, arabe ou sud-asiatique; Le surplus de poids; Le tour de taille élevé, soit la graisse accumulée autour de l’abdomen; La sédentarité; Les mauvaises habitudes alimentaires: comme manger peu ou pas de fruits et légumes; Le tabagisme; L’hypertension artérielle; La présence de maladies associées: pancréatite, infection par le VIH, troubles psychiatriques (schizophrénie, dépression, trouble bipolaire), syndrome des ovaires polykystiques, la goutte (hyperuricémie); La prise de médicaments associés au diabète: glucocorticoïdes (cortisone), médicaments anti-rejet, antipsychotiques atypiques, statines; Des résultats de glycémie anormalement élevés dans le passé; Pour les femmes, avoir donné naissance à un bébé de plus de 4,1 kg (9 livres); Des antécédents de diabète gestationnel; Un faible niveau de scolarité.  Certains facteurs de risque ne peuvent être changés.  Il est toutefois possible de réduire son risque de développer une diabète de type 2 en agissant sur certains facteurs de risque, comme les habitudes alimentaires, l’activité physique et le tabagisme.   Suis-je à risque ? (faites le test)     Étape 1 de 12   8%   Êtes-vous un homme ou une femme?Êtes-vous un homme ou une femme?(Nécessaire)   Homme    Femme    Suivant     Quel âge avez-vous ?Quel âge avez-vous?(Nécessaire)   Précédent Suivant     Quels sont votre poids et votre taille ?Entrez votre poids(Nécessaire)Unités(Nécessaire)LivresKgEntrez votre taille(Nécessaire)   Pieds    Pouces  Entrez votre taille(Nécessaire)Unités(Nécessaire)Pieds et poucesCentimètres   Précédent Suivant     Quel est votre tour de taille ?À l’aide d’un ruban à mesurer, mesurez votre tour de taille à la hauteur du nombril. Expirez, (ne retenez pas votre souffle) puis prenez la mesure. (Remarque : cela n’a rien à voir avec la taille de vos pantalons.)Tour de tailles(Nécessaire)Unités(Nécessaire)CentimètresPouces   Précédent Suivant     Faites-vous habituellement de l'activité physique, comme de la marche rapide, au moins 30 minutes par jour ?Activités(Nécessaire)   Oui    Non    Précédent Suivant     À quelle fréquence mangez-vous des légumes ou des fruits ?Fruits et légumes(Nécessaire)   Tous les jours    Pas tous les jours    Précédent Suivant     Un médecin ou un membre du personnel infirmier vous a-t-il déjà dit que vous faisiez de l'hypertension artérielle OU avez-vous déjà pris des médicaments contre l’hypertension artérielle ?Hypertension(Nécessaire)   Oui    Non ou ne sais pas    Précédent Suivant     Avez-vous déjà eu un résultat de glycémie élevée lors d’une analyse sanguine, d’une maladie ou d’une grossesse ?Glycémie(Nécessaire)   Oui    Non    Précédent Suivant     Avez-vous déjà donné naissance à un bébé de 9 livres (4,1 kg) ou plus ?Bébé(Nécessaire)   Oui    Non / Ne sais pas    Précédent Suivant     Est-ce qu’un membre de votre famille a déjà eu un diagnostic de diabète ?Génétique(Nécessaire)   Oui    Non Si oui, veuillez choisir :(Nécessaire)  Mère   Père   Enfants   Frère(s) et/ou sœur(s)   Autres    Précédent Suivant     Quel est le groupe ethnique de vos parents biologiques ?Mère(Nécessaire)Blanc (type caucasien)AutochtoneNoir (Afro-Antillais)Asiatique de l'Est (Chinois, Vietnamien, Coréen, etc.)Asiatique du Sud (Indien-Oriental, Pakistanais, etc.)Autres(Latino-Américain, Arabe, Asie occidentale. etc)Père(Nécessaire)Blanc (type caucasien)AutochtoneNoir (Afro-Antillais)Asiatique de l'Est (Chinois, Vietnamien, Coréen, etc.)Asiatique du Sud (Indien-Oriental, Pakistanais, etc.)Autres(Latino-Américain, Arabe, Asie occidentale. etc)   Précédent Suivant     Quel est le plus haut niveau de scolarité que vous ayez atteint ?Scolarité(Nécessaire)   Études secondaires ou moins    Diplôme d’études secondaires    Études collégiales ou universitaires    Diplôme d’études collégiales ou universitaires  Précédent Envoyer             Δ   Des ressources pour vous aider Documents  Comprendre et prévenir le diabète de type 2 (dépliant disponible dans la boutique) Le tabagisme et le diabète (dépliant disponible dans la boutique) En forme chez soi 1 (dépliant disponible dans la boutique)   Recherche et rédaction: Équipe de professionnelles de la santé de Diabète Québec Juillet 2023"]
        },
        {
            "tag": "diagnostic",
            "patterns": ["Comment diagnostiquer le diabète", "Comment faire le dépistage", "Comment dépister le diabète"],
            "responses": ["Pour diagnostiquer le diabète, vous pouvez utiliser des tests qui mesurent votre glycémie, votre taux d’insuline et votre taux de lactate de hémoglobine. Pour ce faire, vous pouvez consulter un spécialiste en santé ou utiliser des appareils pour mesurer ces paramètres.", "Le diagnostic du diabète de type 2 En prenant sa glycémie de façon aléatoire (par exemple, en pharmacie), cela peut donner un indice sur la présence ou non d’un diabète de type 2. Cependant, seule une prise de sang analysée en laboratoire permet de poser un diagnostic de diabète.  Le tableau ci-dessous indique les valeurs diagnostiques pour le prédiabète et le diabète qui proviennent des Lignes directrices de pratique clinique 2018 pour la prévention et le traitement du diabète au Canada de Diabète Canada: PrédiabèteDiabète de type 2Glycémie à jeun (glycémie AC)Entre 6,1 et 6,9 mmol/L (anomalie de la glycémie à jeun)7,0 mmol/L et plusHémoglobine glyquée (HbA1c ou A1c)Entre 6,0 et 6,4 %6,5 % et plusGlycémie 2 heures après avoir bu un liquide contenant 75 g de glucose (hyperglycémie provoquée par voie orale ou HGPO)Entre 7,8 et 11,0 mmol/L (intolérance au glucose)11,1 mmol/L et plusGlycémie mesurée à tout moment de la journée–11,1 mmol/L et plus, avec les symptômes classiques Parfois, une deuxième prise de sang est nécessaire afin de confirmer les résultats obtenus.  Le dépistage du diabète de type 2 (mesure de la glycémie à jeun ou de l’hémoglobine glyquée) est recommandé tous les trois ans chez les personnes de 40 ans et plus ou et même plus tôt ou plus fréquemment chez les personnes qui présentent plusieurs facteurs de risque. Qu’est-ce que l’hémoglobine glyquée? L’hémoglobine glyquée (HbA1C ou A1C) représente la moyenne des glycémies des 2-3 derniers mois. Cette mesure est également utilisée pour déterminer le risque de complications. Au moment de passer la prise de sang pour une hémoglobine glyquée seule, il n’est pas nécessaire d’être à jeun. Pour en savoir plus sur l’hémoglobine glyquée, visionnez notre vidéo sur le sujet!"]
        },
        {
            "tag": "pregnant_diabetie",
            "patterns": ["Qu'est ce que le diabète de grossesse","Parle moi du diabète de grossesse"],
            "responses": ["Aussi appelé diabète gestationnel, le diabète de grossesse touche 3 à 20 % des femmes enceintes.  Il se définit par une hyperglycémie, soit un taux élevé de sucre dans le sang, qui se produit pendant la grossesse chez une femme qui ne vivait pas avec le diabète auparavant. Il survient généralement vers la fin du 6e mois de grossesse. Dans la majorité des cas, il disparaît après l’accouchement, mais la mère devient alors à risque de développer le diabète de type 2 dans les années qui suivent. Le diabète de grossesse n’augmente ni le risque de malformations, ni le risque que l’enfant soit diabétique à la naissance.   La cause  Le placenta produit des hormones qui sont très utiles au bon déroulement de la grossesse, mais qui nuisent au travail de l’insuline. L’insuline est une hormone qui permet de faire baisser la glycémie, c’est-à-dire le taux de sucre dans le sang. Chez certaines femmes enceintes, le corps ne parvient pas à sécréter assez d’insuline pour compenser l’effet de ces hormones. Le sucre s’accumule alors dans le sang et fait monter la glycémie. Les symptômes Généralement, la femme enceinte n’a pas de symptômes évidents de diabète. Toutefois, il arrive occasionnellement que des symptômes se manifestent :  Fatigue inhabituelle; Soif exagérée; Augmentation du volume et de la fréquence des urines; Maux de tête.  Ces symptômes peuvent facilement passer inaperçus, car ils sont très fréquents durant la grossesse.    Diabète de grossesse – La grossesse Les femmes qui reçoivent un diagnostic de diabète de grossesse sont prises en charge par une équipe de soins. Des rendez-vous et des échographies supplémentaires pourraient être nécessaires afin d’assurer la santé de la mère et du bébé.   Les femmes à risque Plusieurs facteurs augmentent le risque de développer un diabète de grossesse :  Avoir 35 ans ou plus; Avoir un indice de masse corporel (IMC) égal ou supérieur à 30 avant la grossesse ou gagner du poids au-delà des recommandations au cours des deux premiers trimestres de grossesse; Avoir un membre de sa famille immédiate qui vit avec le diabète de type 2; Avoir une grossesse multiple; Avoir déjà donné naissance à un bébé de plus de 4 kg (9 lb); Avoir déjà développé un diabète de grossesse lors d’une grossesse précédente; Avoir eu des valeurs de glycémie anormalement élevées dans le passé, soit un diagnostic d’intolérance au glucose ou de prédiabète; Être de descendance autochtone, latino-américaine, asiatique, arabe ou africaine ; Prendre un médicament à base de cortisone de façon régulière; Avoir le syndrome des ovaires polykystiques; Avoir l’acanthosis nigricans, c’est-à-dire une décoloration de la peau souvent brunâtre au niveau du cou et sous les bras.  Le dépistage Les Lignes directrices 2018 de pratique clinique de Diabète Canada pour la prévention et la prise en charge du diabète au Canada recommandent un test de dépistage du diabète de grossesse chez toutes les femmes enceintes, entre la 24e et la 28e semaine de grossesse. Pour les femmes plus à risque de développer un diabète de grossesse, le test doit être fait plus tôt. Le test privilégié de dépistage du diabète de grossesse est la mesure de la glycémie 1 heure après l’ingestion d’un liquide contenant 50 g de glucose.  Si le résultat est inférieur à 7,8 mmol/L, le test est normal. Si le résultat est entre 7,8 et 11,0 mmol/L, un test d’hyperglycémie provoquée par voie orale (HGPO) doit être fait pour clarifier le résultat (voir explications ci-dessous). Si le résultat est égal ou supérieur à 11,1 mmol/L, il y a présence de diabète gestationnel.  Le test d’HGPO consiste en l’ingestion d’un liquide sucré contenant 75 g de glucose. Trois prises de sang sont faites: à jeun, 1 heure après l’ingestion du liquide sucré et 2 heures après l’ingestion du liquide sucré. Le diagnostic de diabète est posé si au moins une des valeurs est égale ou supérieure à:  5,3 mmol/L à jeun 10,6 mmol/L 1 heure après l’ingestion du liquide sucré 9,0 mmol/L 2 heures après l’ingestion du liquide sucré  Certains centres hospitalier emploient le test d’HGPO (75 g de glucose) comme seul et unique test diagnostic. Dans ce cas, un diagnostic de diabète gestationnel est posé dès qu’une des valeurs suivantes de glycémie est atteinte:  5,1 mmol/L à jeun 10,0 mmol/L 1 heure après l’ingestion du liquide sucré 8,5 mmol/L 2 heures après l’ingestion du liquide sucré  Les risques possibles du diabète de grossesse s’il n’est pas bien contrôlé   Pour la mère :  Surplus de liquide amniotique, augmentant le risque d’un accouchement prématuré; Accouchement par césarienne ou accouchement vaginal plus difficile (à cause, entre autres, du poids du bébé); Hypertension de grossesse ou prééclampsie (tension artérielle élevée et enflure); Rester diabétique après l’accouchement ou développer à long terme un diabète de type 2 (20 à 50 % de risque dans les 5 à 10 années suivant la grossesse);    Pour le bébé :  Poids de naissance plus élevé que la normale (plus de 4 kg ou 9 lb); Hypoglycémie à la naissance; Blocage lors de la sortie des épaules pendant l’accouchement; Obésité et intolérance au glucose au début de l’âge adulte (surtout si le poids de naissance est plus grand que 4 kg ou 9 lb); Jaunisse, manque de calcium dans le sang ou difficulté respiratoire à la naissance.    Une bonne gestion du diabète de grossesse permet de réduire considérablement les risques de complications, autant pour la mère que pour le bébé. Le traitement Généralement, une saine alimentation qui tient compte des portions et de la répartition des glucides (sucres) ainsi qu’une bonne hygiène de vie (gestion du stress, sommeil adéquat et activité physique régulière) sont suffisantes pour gérer le diabète de grossesse. Si les valeurs de glycémie demeurent trop élevées, le médecin prescrira alors des injections d’insuline ou, dans certains cas, des antihypergycémiants oraux. L’insuline est tout à fait sécuritaire pendant la grossesse. Valeurs cibles de glycémie pour la majorité des femmes enceintes :  À jeun: <5,3 mmol/L 1 heure après un repas: <7,8 mmol/L 2 heures après un repas: <6,7 mmol/L  Votre équipe de soins vous renseignera sur les moments, la fréquence et les valeurs de glycémie que vous devez viser, puisqu’il est possible qu’elles diffèrent de celles présentées ci-dessus. Les valeurs cibles en cas de diabète de grossesse sont plus basses que celles des autres types de diabète. Après la grossesse Les femmes qui ont eu un diabète de grossesse sont beaucoup plus à risque de développer un diabète de type 2 dans les années qui suivent que celles qui n’ont pas eu de diabète de grossesse. Ainsi, il est recommandé de faire ce qui suit:  Passer une prise de sang entre 6 semaines et 6 mois suivant l’accouchement, afin de dépister un prédiabète ou un diabète de type 2; Maintenir de saines habitudes de vie pour réduire le risque de développer le diabète de type 2 ou retarder son apparition; Allaiter dans la mesure du possible immédiatement après la naissance et au moins au cours des quatre premiers mois."]
        },
        {
            "tag": "prediabetic",
            "patterns": ["Qu'est-ce que le prédiabete", "Parle moi du prédiabete"],
            "responses": ["Le prédiabète désigne une glycémie, c’est-à-dire un taux de sucre dans le sang, plus élevée que la normale, mais pas suffisamment pour poser un diagnostic de diabète. Les personnes qui vivent avec le prédiabète ne développeront pas toutes le diabète de type 2, mais beaucoup en seront atteintes. Il s’agit en quelque sorte d’un signal d’alarme indiquant d’amorcer des changements d’habitudes de vie afin de prévenir, ou de moins, retarder l’apparition du diabète de type 2.           Les facteurs de risque D’autres facteurs de risque peuvent contribuer au développement du  diabète de type 2:  Le sexe : les hommes sont plus vulnérables que les femmes; L’âge : le risque augmente à mesure que l’on vieillit; Le surplus de poids; Le tour de taille élevé, soit la graisse accumulée autour de l’abdomen; La sédentarité; L’alimentation non équilibrée; L’hypertension artérielle; Pour les femmes, avoir donné naissance à un bébé de plus de 4,1 kg (9 livres); L’hérédité; L’origine ethnique : autochtone, africaine, asiatique, latino-américaine, etc. Un faible niveau de scolarité.      Les caractéristiques du prédiabète On caractérise parfois le prédiabète selon le moment de la journée où les valeurs de glycémie sont anormales:  Anomalie de la glycémie à jeun : signifie que la glycémie est plus élevée que la normale huit heures après avoir mangé. Intolérance au glucose : signifie que la glycémie s’élève au-dessus de la normale deux heures après avoir bu un liquide contenant 75 g de glucose (sucre), qui équivaut à un repas riches en glucides.  Le diagnostic du prédiabète Seule une prise de sang analysée en laboratoire permet de poser un diagnostic de prédiabète.  Le tableau ci-dessous indique les valeurs diagnostiques pour le prédiabète et le diabète qui proviennent des Lignes directrices de pratique clinique 2018 pour la prévention et le traitement du diabète au Canada de Diabète Canada: PrédiabèteDiabète de type 2Glycémie à jeun (glycémie AC)Entre 6,1 et 6,9 mmol/L (anomalie de la glycémie à jeun)7,0 mmol/L et plusHémoglobine glyquée (HbA1c ou A1c)Entre 6,0 et 6,4 %6,5 % et plusGlycémie 2 heures après avoir bu un liquide contenant 75 g de glucose (hyperglycémie provoquée par voie orale ou HGPO)Entre 7,8 et 11,0 mmol/L (intolérance au glucose)11,1 mmol/L et plusGlycémie mesurée à tout moment de la journée–11,1 mmol/L et plus, avec les symptômes classiques Parfois, une deuxième prise de sang est nécessaire afin de confirmer les résultats obtenus. Le dépistage du diabète de type 2 (mesure de la glycémie à jeun ou de hémoglobine glyquée) est recommandé tous les trois ans chez les personnes de 40 ans et plus ou et même plus tôt ou plus fréquemment chez les personnes qui présentent plusieurs facteurs de risque. La prévention Bonne nouvelle! Il est démontré que la modification de ses habitudes de vie permet de diminuer de près de 60% le risque de développer le diabète de type 2, ou du moins en retarder l’apparition, ainsi que les complications associées. Pour connaître votre niveau de risque de développer le diabète de type 2."]
        },
        {
            "tag": "other_type",
            "patterns": ["Quels sont les autres types de diabète", "Exist-il d'autres types de diabète"],
            "responses": ["Mis à part le diabète de type 1 et de type 2, il existe d’autres types de diabète moins fréquents. Diabète secondaire à certaines maladies    Le diabète peut se déclarer chez les personnes vivant avec certaines maladies ou conditions de santé, telles que :  Maladies pancréatiques (fibrose kystique, cancer, pancréatite, pancréatectomie, etc.); Maladies endocriniennes (syndrome de Cushing, acromégalie, hyperthyroïdie, etc.); Syndromes génétiques (syndrome de Down, ataxie de Friedreich, syndrome de Turner, etc.); Infections virales (rubéole congénitale, cytomégalovirus, etc.).       Diabète secondaire à la prise de médicaments Certains médicaments peuvent augmenter les risques de diabète, de façon temporaire ou permanente, tels que :  Glucocorticoïdes; Médicaments prescrits pour éviter le rejet suite à une transplantation d’organe; Médicaments pour traiter certains cancers; Certains médicaments pour traiter l’hypertension (thiazides); Médicament pour traiter l’hypothyroïdie; Certains médicaments pour traiter l’hypercholestérolémie (statines); Médicament antiépileptique; Médicaments pour traiter certains problèmes de santé mentale.   Les personnes développant le diabète suite à la prise de médicaments sont généralement considérées et traitées comme vivant avec le diabète de type 2.       Diabète MODY et LADA Certaines personnes vivent avec une forme de diabète qui ne peut être classée comme étant de type 1 ou de type 2. Il s’agit de cas rares, dans lesquels le diagnostic est difficile à poser, ou éventuellement remis en question en raison d’une évolution inattendue ou atypique de la maladie.   MODY (Maturity Onset Diabetes of the Young) Le diabète MODY est une forme de diabète rare qui se déclare généralement avant l’âge de 25 ans chez des individus de poids normal. Bien que ces caractéristiques correspondent habituellement à celles du diabète de type 1, ce dernier ressemble davantage au diabète de type 2 : entre autres, les symptômes au moment du diagnostic sont moins prononcés que dans le diabète de type 1 et il y a absence d’acidose. Ce diabète est caractérisé par une anomalie de la sécrétion de l’insuline due à une mutation génétique. Cette condition est fortement héréditaire; les risques de la transmettre à son enfant sont de 50 % lorsqu’on en est porteur. Le diabète MODY est souvent diagnostiqué en premier lieu comme un diabète de type 1. Par contre, il requiert des quantités étonnamment peu élevées d’insuline, et ce, de façon prolongée. Une évolution atypique peut aussi être un indice qu’il s’agit d’un diabète MODY plutôt que de type 1. Si l’on soupçonne ce type de diabète, il est possible d’effectuer des tests génétiques pour identifier le gène muté. Le diabète MODY peut parfois être traité autrement qu’avec des injections d’insuline, car le pancréas sécrète encore de l’insuline, contrairement à la personne vivant avec le diabète de type 1 qui dépend des injections d’insuline pour assurer sa survie.   LADA (Latent Autoimmune Diabetes in Adults) Le diabète LADA, parfois appelé diabète de type 1.5, apparait généralement chez les personnes de 30 à 50 ans de poids normal. Comme le diabète de type 1, il comporte une composante auto-immune, caractérisée par la présence d’auto-anticorps dans le sang. Ces anticorps engendrent une destruction lente et progressive des cellules bêta du pancréas qui sont responsables de la production de l’insuline. Le diabète LADA se distingue toutefois du diabète de type 1 par une progression plus lente vers la destruction complète des cellules bêta. Il ne requiert pas nécessairement d’insuline dès le diagnostic et peut ainsi laisser croire à un diabète de type 2. Il peut s’écouler entre 6 mois et 6 ans avant que l’insuline devienne nécessaire au traitement.       Des ressources pour vous aider Ressources externes  Projet BETTER   Recherche et rédaction : Équipe des professionnelles de la santé de Diabète Québec Avril 2020 © Diabète Québec Références :  Expert Committee. Diabetes Canada 2018 Clinical Practice Guidelines for the Prevention and Management of Diabetes in Canada: Appendix 2 Etiologic Classification of Diabetes Mellitus. Can J Diabetes 2018; 42 (Suppl 1): S308. American Diabetes Association. (2005). Latent Autoimmune Diabetes in Adults [En ligne]. Repéré à http://diabetes.diabetesjournals.org/content/54/suppl_2/S68.full  (page consultée le 15 mai 2018) Leslie D. et Valeri C. (2003) Le LADA (Latent Autoimmune Diabetes in Adults). Diabetes voice Vol 48 p.14-16, Fédération Internationale du Diabète Geoffroy L. et Gonthier M. (2012). Le diabète sous toute ses formes. Dans Le diabète chez l’enfant et l’adolescent, 2e édition. Montréal :Éditions du CHU Ste-Justine"]
        },
        {
            "tag": "diseases_with_diabetie",
            "patterns": ["Quelles sont les maladies associées au diabète"],
            "responses": ["Les maladies associées au diabète comprennent : L’hypertension artérielle, qu’on appelle aussi « haute pression », est présente chez la majorité des personnes vivant avec le diabète de type 2 et chez une bonne partie des personnes vivant avec le diabète de type 1. Le plus souvent, l’hypertension artérielle ne s’accompagne d’aucun symptôme : d’où l’importance de faire des tests de dépistage régulièrement. Les complications L’hypertension artérielle est une véritable bombe à retardement. En entraînant un vieillissement précoce de tous les vaisseaux sanguins de votre corps, elle est un facteur contribuant à plusieurs complications du diabète. Elle favorise l’athérosclérose (dépôt de graisses dans la paroi interne des artères) et peut conduire à un infarctus (crise cardiaque), un accident vasculaire cérébral (thrombose cérébrale ou AVC) ou à l’insuffisance cardiaque ou rénale (néphropathie). La mesure et le contrôle de la tension artérielle Chez les personnes vivant avec le diabète, la tension artérielle devrait être inférieure à 130/80 mmHg. La mesure de la tension artérielle se compose de deux chiffres :  Le plus gros chiffre représente la tension systolique (la pression qui est exercée sur les parois des vaisseaux sanguins pendant les battements du cœur) Le plus petit chiffre représente la tension diastolique (la pression qui est exercée sur les parois des vaisseaux sanguins entre les battements cardiaques)  La prévention Dans certains cas, des changements au niveau du mode de vie suffisent à maintenir une tension artérielle dans les valeurs acceptables, par exemple :  Adopter une alimentation saine (alimentation de type DASH) Réduire son apport en sodium Consommer l’alcool avec modération Être actif tous les jours Maintenir ou viser un poids santé Prendre sa médication telle que prescrite Cesser l’usage du tabac Adopter une saine gestion du stress   Dans d’autres circonstances, la prescription d’un médicament anti-hypertenseur sera nécessaire, mais celui-ci ne doit pas se substituer à une alimentation adéquate ni à une vie active. L’importance de maintenir un poids santé Les personnes qui ont un excès de poids présentent deux fois plus souvent de l’hypertension artérielle que celles qui ont un poids santé. Si un surplus de gras se situe au niveau de l’abdomen, vous êtes plus à risque de développer de l’hypertension artérielle et une maladie cardiovasculaire que s’il se loge autour des hanches et des cuisses. Les recherches démontrent qu’une perte de poids de 5 à 10 % du poids initial (4 kg ou 10 lb) peut amener une diminution de la tension artérielle, et également une diminution des besoins en médicaments anti-hypertenseurs, même si le poids santé n’est pas atteint. Ceci peut donc être une source de motivation supplémentaire pour entreprendre une démarche de saine gestion du poids, si celui-ci menace votre santé. Des ressources pour vous aider Ressources externes  Fondation des maladies du coeur   Recherche et rédaction : Équipe des professionnelles de la santé de Diabète Québec Révision scientifique : Louise Tremblay, infirmière, M. Éd. Janvier 2019 © Diabète Québec, L’apnée du sommeil n’est pas directement une complication du diabète, mais l’un des facteurs de risque important commun aux deux conditions est le fait d’avoir un indice de masse corporelle élevé. C’est l’une des raisons expliquant pourquoi plusieurs personnes vivant avec le diabète font également de l’apnée du sommeil. Les autres facteurs de risque de l’apnée du sommeil sont:  Avoir un menton reculé ou fuyant, un visage étroit ou une petite mâchoire ; Avoir une circonférence de cou élevée ; Avoir des antécédents familiaux d’apnée du sommeil ; Être de sexe masculin ; Être âgé de 50 ans et plus ; Être ménopausée ; Avoir des allergies respiratoires ; Consommer du tabac, de l’alcool ou des somnifères de façon régulière ; Avoir une obstruction nasale importante imposant une respiration par la bouche.    Qu’est-ce que l’apnée du sommeil? Le terme «apnée» signifie une suspension momentanée de la respiration. L’apnée du sommeil se caractérise donc par le fait d’arrêter de respirer en dormant. La forme d’apnée du sommeil la plus fréquente est l’apnée obstructive. Normalement, durant le sommeil, les muscles qui contrôlent la langue, le palais mou et les parois du pharynx maintiennent les voies respiratoires ouvertes. Cependant, chez les personnes qui font de l’apnée du sommeil, il y a un relâchement de ces muscles. Ce relâchement obstrue, en partie ou en totalité, le passage de l’air vers les poumons, ce qui entraîne un arrêt de la respiration. Les arrêts respiratoires peuvent survenir jusqu’à 30 fois par heure et durer de 10 à 60 secondes !  Quelles sont les conséquences potentielles de l’apnée du sommeil ? L’apnée du sommeil peut causer des ronflements et une sensation d’étouffement durant la nuit. De plus, les micro-réveils engendrés par les arrêts respiratoires affectent grandement la qualité du sommeil. Ainsi, des symptômes liés à la fatigue peuvent se manifester durant le jour comme de la somnolence, de l’irritabilité, des maux de tête, etc.  Si la situation perdure, cela peut mener à :  des troubles de la concentration ou de la mémoire ;  une difficulté à vaquer à ses occupations quotidiennes ; une diminution de la performance au travail ;  une augmentation du risque d’accident de la route ;  Une dépression.  En plus des symptômes liés à une mauvaise qualité du sommeil, l’apnée du sommeil augmente les risques de maladies cardiovasculaires et de diabète de type 2. Y a-t-il un impact sur la gestion du diabète ? On sait qu’un sommeil perturbé peut entraîner une augmentation de la glycémie à cause des phénomènes suivants :  diminution de la sensibilité des cellules à l’insuline ; diminution du fonctionnement des cellules qui produisent l’insuline.  Par ailleurs, un manque de sommeil chronique peut s’avérer néfaste pour la gestion du poids en diminuant la quantité d’énergie dépensée par le corps et en augmentant l’appétit. Ainsi, l’apnée du sommeil qui n’est pas traitée peut nuire à la gestion du diabète. Une condition sous diagnostiquée ! On estime que seulement 20% des personnes qui font de l’apnée du sommeil seraient diagnostiquées. Cette faible proportion s’explique entre autres par le fait que c’est une condition qui se développe lentement. De plus, les personnes n’ont pas nécessairement conscience de leurs micro-réveils et la fatigue ressentie est un symptôme qui peut sembler commun et banal pour plusieurs. Dormez-vous debout ? Il existe un test simple et fiable qui permet d’évaluer ses probabilités de somnolence ou d’endormissement pendant la journée dans différentes circonstances de la vie quotidienne, appelé l’échelle de somnolence d’Epworth. Cet outil n’est pas un test de dépistage de l’apnée du sommeil, mais il permet d’indiquer la possibilité qu’il y ait un trouble du sommeil nécessitant une consultation auprès d’un médecin ou bien une évaluation plus approfondie auprès de spécialistes du sommeil. Pour faire le test, cliquez ici.  Quoi faire si vous pensez faire de l’apnée du sommeil ? La première étape est d’en parler à votre médecin. Celui-ci sera en mesure d’évaluer vos symptômes, votre état de santé et vos antécédents, afin de vous prescrire un test de diagnostic au besoin.  Il existe trois tests possibles. Ceux-ci sont remboursés par la Régie de l’assurance maladie du Québec (RAMQ), mais il peut y avoir un délai d’attente. Certaines cliniques privées offrent aussi ces services moyennant des frais. Nom du testEndroit où se fait le testPossibilité de poser un diagnostic d’apnée du sommeilDescription du testSaturométrie nocturneÀ la maisonNon. Selon le résultat obtenu un autre test est nécessaire pour confirmer le diagnostic.Dormir avec une pince au bout du doigt qui mesure le taux d’oxygène dans le sang et la fréquence cardiaque.Polygraphie respiratoire du sommeilÀ la maison OuiDormir avec un équipement portatif et des accessoires qui mesurent différents paramètres.Polysomnographie du sommeilDans un laboratoire ou à l’hôpitalOuiDormir dans un laboratoire avec des électrodes et des capteurs installés sur le corps qui mesurent plusieurs données, dont le temps de sommeil, les stades de sommeil, le débit et les efforts respiratoires. Quel est le traitement? Une fois le diagnostic d’apnée du sommeil confirmé, le premier choix de traitement est la ventilation par pression positive continue (PPC). Ce traitement consiste à dormir avec un appareil qui pousse de l’air de façon continue dans les voies respiratoires par le biais d’un tube et d’un masque. Le jet d’air crée suffisamment de pression pour garder les tissus ouverts, donc les voies respiratoires ne peuvent s’affaisser ou se fermer. Ceci permet de contrôler les arrêts respiratoires et les ronflements. Cette machine est communément appelée CPAP en raison de l’acronyme anglais « continuous positive airway pressure ». La machine est portative et peut donc facilement être transportée lors des déplacements à l’extérieur. Les coûts varient entre 1 500 $ et 2 200 $ et peuvent être remboursés en partie par certains régimes d’assurance privés. Selon les besoins, d’autres traitements de l’apnée du sommeil peuvent être envisagés comme des prothèses, une thérapie positionnelle ou encore des bandelettes nasales. La majorité des personnes souffrant d’apnée du sommeil qui traitent ce problème rapportent de nombreux bienfaits et une amélioration substantielle de leur qualité de vie.  Des ressources pour vous aider Ressources externes  Association pulmonaire du Québec Société canadienne du sommeil  Fondation Sommeil   Recherche et rédaction : Équipe des professionnelles de la santé de Diabète Québec Août 2020 © Diabète Québec, La capsulite est une inflammation de la capsule articulaire, solide gaine fibreuse entourant les os de l’épaule. Dans 50 % des cas, elle se présente des deux côtés. Les causes Cette inflammation peut être causée par des petits traumatismes répétés (coups, mouvements répétés, élongation ou chutes), un traumatisme violent ou des maladies inflammatoires. Dans certains cas, il s’avère impossible de trouver la cause exacte. Le vieillissement joue également un rôle dans l’apparition de ce problème. Plus une personne avance en âge, plus les cartilages articulaires dégénèrent et cicatrisent lentement. Au début de la quarantaine, on note une réduction de la masse musculaire, ce qui peut affaiblir l’articulation. De plus, la diminution de la capacité de compensation de l’organisme entraîne parfois la réapparition d’anciens problèmes au niveau des muscles et des os.   La capsulite et le diabète La personne vivant avec le diabète est plus exposée aux atteintes articulaires des membres supérieurs, dont la capsulite, laquelle apparaît le plus souvent une vingtaine d’années après le début du diabète. Chez la personne vivant avec le diabète, l’hyperglycémie peut aussi entraîner une complication appelée neuropathie. Cette perte de sensibilité à la douleur peut « masquer » la douleur (signal d’alarme du corps) dès le début de l’inflammation et compromettre le diagnostic précoce de la capsulite. Quand consulter ? Il est important pour la personne vivant avec le diabète de rester vigilante, de consulter dès l’apparition d’une limitation dans les mouvements de l’épaule et de suivre les recommandations du médecin.  Recherche et rédaction : Équipe des professionnelles de la santé de Diabète Québec Adapté de : Godin L. (2002). La capsulite. Plein Soleil, Diabète Québec, p.31 Janvier 2019 © Diabète Québec Référence : Zreik NH. et al.(2016). Adhesive capsulitis of the shoulder and diabetes: a meta-analysis of prevalence. Muscles, Ligaments and Tendons Journal, 6(1), 26-34."]
        },
        {
            "tag": "blood_pressure",
            "patterns": ["Le contrôle de la tension artérielle", "Qu'est ce que l’hypertension artérielle"],
            "responses": ["L’hypertension artérielle, qu’on appelle aussi « haute pression », est présente chez la majorité des personnes vivant avec le diabète de type 2 et chez une bonne partie des personnes vivant avec le diabète de type 1. Le plus souvent, l’hypertension artérielle ne s’accompagne d’aucun symptôme : d’où l’importance de faire des tests de dépistage régulièrement. Les complications L’hypertension artérielle est une véritable bombe à retardement. En entraînant un vieillissement précoce de tous les vaisseaux sanguins de votre corps, elle est un facteur contribuant à plusieurs complications du diabète. Elle favorise l’athérosclérose (dépôt de graisses dans la paroi interne des artères) et peut conduire à un infarctus (crise cardiaque), un accident vasculaire cérébral (thrombose cérébrale ou AVC) ou à l’insuffisance cardiaque ou rénale (néphropathie). La mesure et le contrôle de la tension artérielle Chez les personnes vivant avec le diabète, la tension artérielle devrait être inférieure à 130/80 mmHg. La mesure de la tension artérielle se compose de deux chiffres :  Le plus gros chiffre représente la tension systolique (la pression qui est exercée sur les parois des vaisseaux sanguins pendant les battements du cœur) Le plus petit chiffre représente la tension diastolique (la pression qui est exercée sur les parois des vaisseaux sanguins entre les battements cardiaques)  La prévention Dans certains cas, des changements au niveau du mode de vie suffisent à maintenir une tension artérielle dans les valeurs acceptables, par exemple :  Adopter une alimentation saine (alimentation de type DASH) Réduire son apport en sodium Consommer l’alcool avec modération Être actif tous les jours Maintenir ou viser un poids santé Prendre sa médication telle que prescrite Cesser l’usage du tabac Adopter une saine gestion du stress   Dans d’autres circonstances, la prescription d’un médicament anti-hypertenseur sera nécessaire, mais celui-ci ne doit pas se substituer à une alimentation adéquate ni à une vie active. L’importance de maintenir un poids santé Les personnes qui ont un excès de poids présentent deux fois plus souvent de l’hypertension artérielle que celles qui ont un poids santé. Si un surplus de gras se situe au niveau de l’abdomen, vous êtes plus à risque de développer de l’hypertension artérielle et une maladie cardiovasculaire que s’il se loge autour des hanches et des cuisses. Les recherches démontrent qu’une perte de poids de 5 à 10 % du poids initial (4 kg ou 10 lb) peut amener une diminution de la tension artérielle, et également une diminution des besoins en médicaments anti-hypertenseurs, même si le poids santé n’est pas atteint. Ceci peut donc être une source de motivation supplémentaire pour entreprendre une démarche de saine gestion du poids, si celui-ci menace votre santé. Des ressources pour vous aider Ressources externes  Fondation des maladies du coeur   Recherche et rédaction : Équipe des professionnelles de la santé de Diabète Québec Révision scientifique : Louise Tremblay, infirmière, M. Éd. Janvier 2019 © Diabète Québec"]
        },
        {
            "tag": "Sleep_apnea",
            "patterns": ["L’apnée du sommeil", "Qu'est ce que l’apnée du sommeil"],
            "responses": ["L’apnée du sommeil n’est pas directement une complication du diabète, mais l’un des facteurs de risque important commun aux deux conditions est le fait d’avoir un indice de masse corporelle élevé. C’est l’une des raisons expliquant pourquoi plusieurs personnes vivant avec le diabète font également de l’apnée du sommeil. Les autres facteurs de risque de l’apnée du sommeil sont:  Avoir un menton reculé ou fuyant, un visage étroit ou une petite mâchoire ; Avoir une circonférence de cou élevée ; Avoir des antécédents familiaux d’apnée du sommeil ; Être de sexe masculin ; Être âgé de 50 ans et plus ; Être ménopausée ; Avoir des allergies respiratoires ; Consommer du tabac, de l’alcool ou des somnifères de façon régulière ; Avoir une obstruction nasale importante imposant une respiration par la bouche.    Qu’est-ce que l’apnée du sommeil? Le terme «apnée» signifie une suspension momentanée de la respiration. L’apnée du sommeil se caractérise donc par le fait d’arrêter de respirer en dormant. La forme d’apnée du sommeil la plus fréquente est l’apnée obstructive. Normalement, durant le sommeil, les muscles qui contrôlent la langue, le palais mou et les parois du pharynx maintiennent les voies respiratoires ouvertes. Cependant, chez les personnes qui font de l’apnée du sommeil, il y a un relâchement de ces muscles. Ce relâchement obstrue, en partie ou en totalité, le passage de l’air vers les poumons, ce qui entraîne un arrêt de la respiration. Les arrêts respiratoires peuvent survenir jusqu’à 30 fois par heure et durer de 10 à 60 secondes !  Quelles sont les conséquences potentielles de l’apnée du sommeil ? L’apnée du sommeil peut causer des ronflements et une sensation d’étouffement durant la nuit. De plus, les micro-réveils engendrés par les arrêts respiratoires affectent grandement la qualité du sommeil. Ainsi, des symptômes liés à la fatigue peuvent se manifester durant le jour comme de la somnolence, de l’irritabilité, des maux de tête, etc.  Si la situation perdure, cela peut mener à :  des troubles de la concentration ou de la mémoire ;  une difficulté à vaquer à ses occupations quotidiennes ; une diminution de la performance au travail ;  une augmentation du risque d’accident de la route ;  Une dépression.  En plus des symptômes liés à une mauvaise qualité du sommeil, l’apnée du sommeil augmente les risques de maladies cardiovasculaires et de diabète de type 2. Y a-t-il un impact sur la gestion du diabète ? On sait qu’un sommeil perturbé peut entraîner une augmentation de la glycémie à cause des phénomènes suivants :  diminution de la sensibilité des cellules à l’insuline ; diminution du fonctionnement des cellules qui produisent l’insuline.  Par ailleurs, un manque de sommeil chronique peut s’avérer néfaste pour la gestion du poids en diminuant la quantité d’énergie dépensée par le corps et en augmentant l’appétit. Ainsi, l’apnée du sommeil qui n’est pas traitée peut nuire à la gestion du diabète. Une condition sous diagnostiquée ! On estime que seulement 20% des personnes qui font de l’apnée du sommeil seraient diagnostiquées. Cette faible proportion s’explique entre autres par le fait que c’est une condition qui se développe lentement. De plus, les personnes n’ont pas nécessairement conscience de leurs micro-réveils et la fatigue ressentie est un symptôme qui peut sembler commun et banal pour plusieurs. Dormez-vous debout ? Il existe un test simple et fiable qui permet d’évaluer ses probabilités de somnolence ou d’endormissement pendant la journée dans différentes circonstances de la vie quotidienne, appelé l’échelle de somnolence d’Epworth. Cet outil n’est pas un test de dépistage de l’apnée du sommeil, mais il permet d’indiquer la possibilité qu’il y ait un trouble du sommeil nécessitant une consultation auprès d’un médecin ou bien une évaluation plus approfondie auprès de spécialistes du sommeil. Pour faire le test, cliquez ici.  Quoi faire si vous pensez faire de l’apnée du sommeil ? La première étape est d’en parler à votre médecin. Celui-ci sera en mesure d’évaluer vos symptômes, votre état de santé et vos antécédents, afin de vous prescrire un test de diagnostic au besoin.  Il existe trois tests possibles. Ceux-ci sont remboursés par la Régie de l’assurance maladie du Québec (RAMQ), mais il peut y avoir un délai d’attente. Certaines cliniques privées offrent aussi ces services moyennant des frais. Nom du testEndroit où se fait le testPossibilité de poser un diagnostic d’apnée du sommeilDescription du testSaturométrie nocturneÀ la maisonNon. Selon le résultat obtenu un autre test est nécessaire pour confirmer le diagnostic.Dormir avec une pince au bout du doigt qui mesure le taux d’oxygène dans le sang et la fréquence cardiaque.Polygraphie respiratoire du sommeilÀ la maison OuiDormir avec un équipement portatif et des accessoires qui mesurent différents paramètres.Polysomnographie du sommeilDans un laboratoire ou à l’hôpitalOuiDormir dans un laboratoire avec des électrodes et des capteurs installés sur le corps qui mesurent plusieurs données, dont le temps de sommeil, les stades de sommeil, le débit et les efforts respiratoires. Quel est le traitement? Une fois le diagnostic d’apnée du sommeil confirmé, le premier choix de traitement est la ventilation par pression positive continue (PPC). Ce traitement consiste à dormir avec un appareil qui pousse de l’air de façon continue dans les voies respiratoires par le biais d’un tube et d’un masque. Le jet d’air crée suffisamment de pression pour garder les tissus ouverts, donc les voies respiratoires ne peuvent s’affaisser ou se fermer. Ceci permet de contrôler les arrêts respiratoires et les ronflements. Cette machine est communément appelée CPAP en raison de l’acronyme anglais « continuous positive airway pressure ». La machine est portative et peut donc facilement être transportée lors des déplacements à l’extérieur. Les coûts varient entre 1 500 $ et 2 200 $ et peuvent être remboursés en partie par certains régimes d’assurance privés. Selon les besoins, d’autres traitements de l’apnée du sommeil peuvent être envisagés comme des prothèses, une thérapie positionnelle ou encore des bandelettes nasales. La majorité des personnes souffrant d’apnée du sommeil qui traitent ce problème rapportent de nombreux bienfaits et une amélioration substantielle de leur qualité de vie.  Des ressources pour vous aider Ressources externes  Association pulmonaire du Québec Société canadienne du sommeil  Fondation Sommeil   Recherche et rédaction : Équipe des professionnelles de la santé de Diabète Québec Août 2020 © Diabète Québec"]
        },
        {
            "tag": "capsulite",
            "patterns": ["La capsulite", "Qu'est ce que la capsulite"],
            "responses": ["La capsulite est une inflammation de la capsule articulaire, solide gaine fibreuse entourant les os de l’épaule. Dans 50 % des cas, elle se présente des deux côtés. Les causes Cette inflammation peut être causée par des petits traumatismes répétés (coups, mouvements répétés, élongation ou chutes), un traumatisme violent ou des maladies inflammatoires. Dans certains cas, il s’avère impossible de trouver la cause exacte. Le vieillissement joue également un rôle dans l’apparition de ce problème. Plus une personne avance en âge, plus les cartilages articulaires dégénèrent et cicatrisent lentement. Au début de la quarantaine, on note une réduction de la masse musculaire, ce qui peut affaiblir l’articulation. De plus, la diminution de la capacité de compensation de l’organisme entraîne parfois la réapparition d’anciens problèmes au niveau des muscles et des os.   La capsulite et le diabète La personne vivant avec le diabète est plus exposée aux atteintes articulaires des membres supérieurs, dont la capsulite, laquelle apparaît le plus souvent une vingtaine d’années après le début du diabète. Chez la personne vivant avec le diabète, l’hyperglycémie peut aussi entraîner une complication appelée neuropathie. Cette perte de sensibilité à la douleur peut « masquer » la douleur (signal d’alarme du corps) dès le début de l’inflammation et compromettre le diagnostic précoce de la capsulite. Quand consulter ? Il est important pour la personne vivant avec le diabète de rester vigilante, de consulter dès l’apparition d’une limitation dans les mouvements de l’épaule et de suivre les recommandations du médecin.  Recherche et rédaction : Équipe des professionnelles de la santé de Diabète Québec Adapté de : Godin L. (2002). La capsulite. Plein Soleil, Diabète Québec, p.31 Janvier 2019 © Diabète Québec Référence : Zreik NH. et al.(2016). Adhesive capsulitis of the shoulder and diabetes: a meta-analysis of prevalence. Muscles, Ligaments and Tendons Journal, 6(1), 26-34."]
        },
        {
            "tag": "hyperglycemia_treatment",
            "patterns": ["Comprendre et traiter l’hyperglycémie"],
            "responses": ["L’hyperglycémie se définit par une glycémie (taux de sucre dans le sang) au-delà des valeurs cibles pour la majorité des personnes vivant avec le diabète, soit :  au-dessus de 7 mmol/L, à jeun ou avant un repas au-dessus de 10 mmol/L, deux heures après le début d’un repas  Elle se produit lorsque la quantité d’insuline dans le sang est insuffisante ou inefficace. Le glucose (sucre) ne pouvant entrer dans les cellules par manque d’insuline, il s’accumule dans le sang et fait monter la glycémie.  À noter que pour les femmes enceintes vivant avec le diabète, les valeurs d’hyperglycémie sont de:  À jeun: au-dessus de 5,3 mmol/L 1 heure après un repas: au-dessus de 7,8 mmol/L 2 heures après un repas: au-dessus de 6,7 mmol/L       Vidéo: L’hyperglycémie   Les symptômes Chez certaines personnes, l’hyperglycémie peut passer inaperçue. Cependant, au-delà d’un certain seuil, une glycémie trop élevée peut conduire à l’apparition des symptômes suivants :  fatigue urines abondantes soif intense faim exagérée perte de poids involontaire irritabilité étourdissements  Les causes Les principales causes de l’hyperglycémie sont :  une alimentation plus riche en glucides qu’à l’habitude une diminution de l’activité physique une insuffisance d’insuline et/ou de médicaments antidiabétiques (erreur de dosage ou oubli d’une dose) un stress physique (maladie, chirurgie, infection, etc.) ou psychologique (deuil, nouvel emploi, déménagement, etc.) la prise de certains médicaments (ex.: la cortisone)  Deux phénomènes moins connus, le phénomène de l’aube et l’effet Somogyi, peuvent aussi être à l’origine d’une hyperglycémie. Prévenir l’hyperglycémie Dans la plupart des cas, l’hyperglycémie peut être évitée en adoptant les précautions suivantes :  mesurer la glycémie régulièrement suivre le plan d’alimentation élaboré avec un ou une diététiste/nutritionniste prendre l’insuline ou les médicaments antidiabétiques tels que prescrits ajuster l’insuline selon la prescription médicale  Le traitement En présence de symptômes d’hyperglycémie, la personne vivant avec le diabète doit prendre les mesures suivantes :  mesurer sa glycémie plus fréquemment pour la personne vivant avec le diabète de type 1 : si la glycémie est supérieure à 14 mmol/L, vérifier la présence de corps cétoniques dans l’urine ou dans le sang boire régulièrement de l’eau pour prévenir la déshydratation  ajuster l’insuline selon la prescription médicale identifier la cause de l’hyperglycémie et prendre les mesures appropriées, si possible  Situations d’urgence Consultez un médecin sans délai si une ou plusieurs de ces situations se présentent:  Aucun liquides n’est toléré en raison de vomissements ou de diarrhées; Il y a changement de l’état de conscience chez la personne, tel que confusion, agitation, absence de réaction aux stimulations, hallucinations ou comportement inhabituel; Il y a présence de signes de déshydratation : bouche sèche, yeux creux, peau moins élastique, etc.; La température corporelle est au-dessus de 38,5°C depuis plus de 48 heures.  Chez la personne diabétique de type 1 :  La glycémie est supérieure à 14 mmol/L et il y présence de corps cétoniques:  dans l’urine : taux « moyen » à « fort » (valeur au-dessus de 4 mmol/L) dans le sang : valeur au-dessus de 1,5 mmol/L   La glycémie est supérieure à 20 mmol/L avec nausées, vomissements et/ou douleurs abdominales  Chez la personne diabétique de type 2 :  La glycémie est supérieure à 25 mmol/L avec somnolence excessive.  Ces symptômes pourraient indiquer une urgence hyperglycémique."]
        },
        {
            "tag": "morning_hyperglycimia",
            "patterns": ["Hyperglycémie du matin: L’hyperglycémie de rebond et le phénomène de l’aube", "L’hyperglycémie de rebond", "le phénomène de l’aube", "Hyperglycémie du matin", "Qu'est ce que l'hyperglycémie du matin"],
            "responses": ["Suite à ses observations scientifiques, Michael Somogyi, biochimiste et professeur à l’Université de Washington, a émis, dans les années 50, l’hypothèse que «l’hypoglycémie pouvait engendrer l’hyperglycémie». De nos jours, on parle de « l’effet Somogyi » qui se caractérise par une hausse de la glycémie du matin suite à une hypoglycémie nocturne non détectée et non traitée chez les personnes diabétiques qui s’injectent de l’insuline. Pour compenser l’hypoglycémie, le corps sécrète des  hormones de contre-régulation, comme le glucagon et l’adrénaline, ce qui a pour effet d’augmenter la glycémie du matin. On parle alors d’hyperglycémie rebond. Bien que cette hypothèse n’ait jamais été démontrée par les recherches, les professionnels oeuvrant dans le domaine du diabète estiment qu’il faut suspecter l’effet Somogyi chez une personne qui continue de présenter des hyperglycémies le matin alors que le dosage de l’insuline au coucher est graduellement augmenté.      Les personnes diabétiques traitées à l’insuline dont les résultats de glycémie sont élevés au réveil (supérieurs à 7 mmol/L), devraient mesurer leur glycémie vers 3h am ou lors du pic d’action de l’insuline du coucher durant au moins deux nuits consécutives. Si à ce moment la glycémie est inférieure à 4 mmol/L, vous êtes en hypoglycémie et vous pourrez peut-être expliquer votre hyperglycémie matinale par l’effet Somogyi. Identifier la cause de l’hypoglycémie pour prévenir l’hyperglycémie rebond Voici quelques causes de l’hypoglycémie nocturne:  Une dose d’insuline trop élevée au coucher Un problème relié à votre technique d’injection de l’insuline Une consommation de glucides plus faible qu’à l’habitude au souper ou durant la soirée Une consommation d’alcool à jeun ou de façon excessive Une activité physique inhabituelle durant la journée  Après avoir trouver la cause, une discussion avec le médecin pourrait déterminer s’il y a lieu de diminuer le dosage d’insuline au coucher ou de modifier le type d’insuline. Le phénomène de l’aube Le phénomène de l’aube est un processus naturel qui se produit vers la fin de la nuit. Le corps libère à ce moment des hormones, telles que le cortisol, l’adrénaline et l’hormone de croissance, qui agissent dans le but, entre autres, de préparer le corps au réveil. Ces hormones favorisent la sécrétion de glucose par le foie en plus de nuire à l’action de l’insuline, ce qui peut faire augmenter la glycémie. Ainsi, il est possible de se réveiller le matin avec une glycémie élevée alors qu’elle se trouvait dans les valeurs cibles au coucher, sans avoir mangé. Un ajustement de la médication peut parfois s’avérer nécessaire pour corriger le problème. Si cela est votre cas, parlez-en à votre médecin."]
        },
        {
            "tag": "Ketone_bodies",
            "patterns": ["Corps cétoniques", "Que sont les corps cétoniques?"],
            "responses": ["Les corps cétoniques proviennent de la dégradation des graisses. Leur accumulation dans le sang est toxique pour le corps. Cette situation survient lorsque le corps manque d’insuline et qu’il doit puiser dans ses réserves de graisse pour obtenir l’énergie que lui fournit habituellement le glucose. Comment mesure-t-on les corps cétoniques? On les mesure dans le sang avec un glucomètre et des bandelettes cétoniques, ou dans l’urine avec des bâtonnets réactifs. Quand mesurer les corps cétoniques? Pour les personnes vivant avec le diabète de type 1, si votre glycémie est supérieure à 14 mmol/L, mesurez vos corps cétoniques toutes les 2 à 4 heures, et buvez au moins 250 ml (1 tasse) d’eau toutes les heures. Allez à l’urgence si votre glycémie est supérieure à 14 mmol/L et que votre niveau de corps cétoniques est :  dans le sang: au-dessus de 1,5 mmol/L  dans l’urine:  un taux « moyen » à « fort » (au-dessus de 4)"]
        },
        {
            "tag": "hyperglycemia_emergency",
            "patterns": ["Les urgences hyperglycémiques", "Quelles sont les urgences hyperglycémiques"],
            "responses": ["Il y a deux types d’urgences hyperglycémiques:  L’acidocétose diabétique, surtout chez les personnes vivant avec le diabète de type 1 L’état d’hyperglycémie hyperosmolaire, surtout chez les personnes vivant avec le diabète de type 2.  L’acidocétose diabétique peut également survenir chez les personnes qui n’ont pas encore été diagnostiquées avec le diabète de type 1. Ces situations nécessitent une intervention médicale d’urgence et peuvent entraîner des conséquences graves, tel un coma, voire même la mort, si elles ne sont pas traitées. Elles peuvent survenir lors de situations particulières, entre autres, lors des journées de maladie.       L'acidocétose diabétique      L’acidocétose diabétique se caractérise par :  L’hyperglycémie, souvent supérieure à 20 mmol/L ; La présence de corps cétoniques dans le sang ou l’urine.  L’acidocétose diabétique est causée par un manque d’insuline. Comme il n’y a pas assez d’insuline, le glucose n’est pas absorbé et s’accumule dans le sang. Le manque d’insuline va aussi amener le corps à transformer les graisses en glucose, ce qui produit des corps cétoniques. L’accumulation des corps cétoniques est toxique pour le corps. Les symptômes suivants sont associés à l’acidocétose diabétique :  Respiration profonde et rapide Haleine fruitée (odeur cétonique) Nausées, vomissements Douleurs abdominales Mal de tête Changement de l’état de conscience, confusion, agitation, comportement inhabituel.  EN PRÉSENCE DE CES SYMPTÔMES, CONSULTEZ UN MÉDECIN RAPIDEMENT OU PRÉSENTEZ-VOUS À L’URGENCE. Voici quelques situations pouvant précipiter une acidocétose diabétique:  Oubli d’une dose d’insuline ; Mauvais ajustement de la dose d’insuline ; Arrêt de la pompe à insuline ; Problème médical grave (ex. : infarctus, pneumonie).          L’état d’hyperglycémie hyperosmolaire      L’état d’hyperglycémie hyperosmolaire est caractérisé par :  Une hyperglycémie, souvent supérieure à 30 mmol/L* Une déshydratation sévère.  Les causes sont :  Le manque d’insuline ; La sécrétion d’hormones qui augmentent la glycémie (par exemple, glucagon, cortisol).  Ces hormones sont sécrétées en raison du glucose qui n’est pas utilisé par les cellules ou en raison d’un stress. Contrairement à l’acidocétose diabétique, il n’y a habituellement pas d’accumulation de corps cétoniques dans le sang ou dans l’urine, puisque l’insuline n’est pas totalement absente. L’état d’hyperglycémie hyperosmolaire peut arriver pour diverses raisons, telles que :  L’arrêt de la prise des médicaments pour le diabète ; Une infection (par exemple, pneumonie, infection urinaire) ; Un problème cardiovasculaire (par exemple, crise cardiaque, AVC) ; La consommation de substances (alcool, drogues) ; La prise de certains médicaments :    diurétiques thiazidiques (par exemple, hydrochlorothiazide, indapamide) ;   glucocorticoïdes (par exemple, cortisone, prednisolone, dexaméthasone) ; antipsychotiques atypiques (par exemple, rispéridone, quétiapine, olanzapine, clozapine, aripiprazole).    Les symptômes sont principalement ceux de l’hyperglycémie, soit:   Urines fréquentes et abondantes ; Soif intense ; Grande fatigue.  Ces symptômes sont généralement accompagnés de signes de déshydratation tels que :  La bouche sèche ; Les yeux creux ; Des étourdissements ; La peau moins élastique, etc.  Lors d’une hyperglycémie, l’accumulation du glucose dans le sang augmente la fréquence et le volume des urines. Ceci peut occasionner une perte excessive d’eau et causer une déshydratation importante. Peut s’ensuivre une baisse de la pression sanguine menant à une altération de l’état de conscience et, éventuellement, au coma s’il n’y a aucune intervention médicale. Qui est à risque? Si le diabète est bien géré, le risque est minime. Le risque est toutefois plus élevé chez certaines personnes, soit:  Les personnes avec une atteinte de la fonction rénale ; Les personnes âgées.  *Les personnes qui prennent des médicaments de la classe des iSGLT-2 (canagliflozine (InvokanaMD), empagliflozine (JardianceMD), dapagliflozine (ForxigaMD)) pourraient avoir une glycémie moins élevée alors qu’ils sont dans un état d’hyperglycémie hyperosmolaire.         Quand consulter d’urgence?      Consultez un médecin sans délai si une ou plusieurs de ces situations se présentent:  Aucun liquide n’est toléré en raison de vomissements ou de diarrhées ; Il y a un changement de l’état de conscience chez la personne, tel que confusion, agitation, absence de réaction aux stimulations, hallucinations ou comportement inhabituel ; Il y a présence de signes de déshydratation : bouche sèche, yeux creux, étourdissements, peau moins élastique, etc. ; La température corporelle est au-dessus de 38,5°C depuis plus de 48 heures.  Chez la personne vivant avec le diabète de type 1 :  La glycémie est supérieure à 14 mmol/L et il y présence de corps cétoniques:  dans l’urine : taux « moyen » à « fort » (valeur au-dessus de 4 mmol/L) dans le sang : valeur au-dessus de 1,5 mmol/L   La glycémie est supérieure à 20 mmol/L avec nausées, vomissements et/ou douleurs abdominales  Chez la personne vivant avec le diabète de type 2 :  La glycémie est supérieure à 25 mmol/L avec somnolence excessive.          Prévenir les urgences hyperglycémiques      En plus des conseils de base pour prévenir l’hyperglycémie, les recommandations suivantes peuvent vous aider à prévenir une urgence hyperglycémique. Pour la personne vivant avec le diabète de type 1 :  Vérifier la présence de corps cétoniques dans l’urine ou dans le sang lorsque la glycémie est supérieure à 14mmol/L ou lors de jours de maladie. Mesurer plus fréquemment la glycémie et suivre le protocole établi par votre équipe de soins lors des jours de maladie. S’hydrater adéquatement si la glycémie est supérieure à 14 mmol/L.  Pour la personne vivant avec le diabète de type 2 :  Mesurer plus fréquemment la glycémie et suivre les recommandations de votre équipe de soins lors des jours de maladie. S’hydrater adéquatement (250 ml d’eau toutes les heures) si la glycémie est supérieure à 14 mmol/L.        Des ressources pour vous aider Documents  Comment gérer votre diabète de type 2 lorsque vous êtes malade?  Ressources externes  Projet BETTER   Recherche et rédaction: Équipe de professionnelles de la santé de Diabète Québec Juin 2014 (mis à jour juillet 2023)"]
        },
        {
            "tag": "type_2_diabetes_remission",
            "patterns": ["Rémission du diabète de type 2", "Parle moi de la rémission du diabète de type 2", "Qu'est ce que la rémission du diabète de type 2"],
            "responses": ["La rémission du diabète de type 2 est définie par un retour de l’hémoglobine glyquée (HbA1c) en-dessous de 6%, et cela sans prendre de médicaments pour le diabète, et pendant au moins 3 mois. La rémission du diabète ne veut pas dire guérison du diabète. La rémission du diabète est, dans la majorité des cas, temporaire. Elle implique donc la possibilité de rechute, c’est-à-dire de retour du diabète de type 2, après plusieurs mois ou années. La rechute est définie par le retour de l’hémoglobine glyquée à 6,5% et plus ou lorsqu’il y a une réintroduction de la médication pour la gestion du diabète ou de ses complications.     La rémission du diabète peut être considérée, chez certaines personnes, comme une option de traitement de plus dans la gestion du diabète et de ses complications. Elle n’est cependant pas une solution au diabète.     Qui peut tenter une rémission du diabète de type 2 ? La rémission du diabète n’est pas pour tout le monde. Il n’existe actuellement pas de prédicteur de succès. Les personnes qui ont le plus de chance d’atteindre une rémission sont celles qui :  ont un diagnostic récent, soit moins de 6 ans ; présentent un surpoids ou une obésité et qui ont un potentiel de perte de poids ; n’ont pas des valeurs de glycémie très élevées ; n’utilisent pas d’insuline.  Les personnes pour qui la tentative de rémission est fortement déconseillée sont celles qui :  Présentent des complications du diabète ; Vivent avec un trouble de conduite alimentaire ou de santé mentale.  Comment obtenir une rémission du diabète de type 2 ? Les épisodes de rémission sont principalement observés dans un contexte de perte de poids importante, soit plus de 15 kg (33 lb). Actuellement, il existe trois approches :  1. La chirurgie bariatrique C’est l’approche la plus efficace. Elle nécessite, toutefois, une intervention chirurgicale irréversible et qui présente des risques de complications plus élevés. Elle s’adresse aux personnes ayant un IMC au-dessus de 35. Avec cette approche, entre 30 à 60 % des personnes étaient en rémission après 5 ans. Moins de 50 % était encore en rémission après 8 ans.  2. La diète très faible en calories via la prise de substituts de repas liquides C’est une approche basée sur une alimentation restrictive et très faible en calories. Pendant environ 5 mois, les repas sont constitués de 1 à 2 bouillons ou substituts de repas liquides uniquement (par exemple, Glucerna®, Boost®, Optifast®). Ensuite, les aliments sont réintroduits progressivement pendant 1 à 2 mois. L’alimentation demeure toutefois contrôlée en calories et l’ajout d’activité physique est fortement recommandée pour aider au maintien du poids. Les substituts de repas pourraient également être réintroduits en cas de reprise de poids. Avec cette approche, 50 % des personnes étaient en rémission après 1 an. Il ne restait qu’1 personne sur 3 encore en rémission, après 2 ans.  3. Le programme d’exercice physique combiné à une alimentation faible en calories Cette approche dure entre 4 à 12 mois. Elle comprend :  De l’activité physique pendant 30 à 60 minutes, de 5 à 6 jours par semaine Une alimentation faible en calories.  Avec cette approche, 1 personne sur 4 était en rémission après 2 ans. Bénéfices de la rémission Il n’y a pas d’études qui démontrent les bénéfices sur la santé de la rémission du diabète de type 2. Toutefois, l’amélioration de l’hémoglobine glyquée et la perte de poids sont reconnues pour diminuer les risques de complications du diabète et la résistance à l’insuline. Mise en garde Avant la tentative de rémission, il est important d’avoir une discussion approfondie avec votre équipe de soins sur les risques et les bénéfices associés à la rémission. Une évaluation devrait également être faite. Le protocole pour tenter une rémission du diabète demande un engagement important et prolongé qui peut entraîner des répercussions négatives sur l‘estime de soi si la rémission n’est pas atteinte ou en cas de rechute. Pendant la tentative de rémission, il est primordial d’être encadré par une équipe de professionnel(le)s de la santé spécialisée. Des suivis et des ajustements devront être faits tout au long du processus pour assurer un déroulement sécuritaire. Si la rémission est atteinte Des prises de sang devront être faites aux 6 mois pour assurer l’absence de récidive du diabète. Malgré la rémission, les saines habitudes de vie et la surveillance de la tension artérielle et du cholestérol demeurent essentielles."]
        },
        {
            "tag": "foot_care",
            "patterns": ["Soin des pieds", "Qu'est ce que le soin des pieds"],
            "responses": ["Le soin des pieds fait partie de la vie des personnes vivant avec le diabète, au même titre que la mesure régulière de la glycémie. Le diabète peut, à long terme, occasionner une diminution de la sensibilité aux pieds et, conséquemment, une blessure ou une brûlure peut passer inaperçue. Des problèmes de circulation sanguine peuvent également survenir en raison de l’épaississement et de la perte d’élasticité des artères, ce qui peut nuire à la guérison d’une plaie et augmenter le risque de gangrène. Cependant, plusieurs recherches démontrent que la mise en application de certaines mesures préventives réduit considérablement les complications au niveau des pieds. En effet, cela contribue à maintenir votre peau saine et à prévenir tout traumatisme à vos pieds. Ces mesures préventives s’ajoutent à certaines recommandations générales, telles que :   vous alimenter de façon équilibrée ; faire de l’activité physique régulièrement ; maintenir votre glycémie dans les valeurs cibles ; faire vérifier votre tension artérielle régulièrement ; prendre votre médication telle que prescrite ; cesser de fumer ou de vapoter, s’il y a lieu.  La mise en application de certaines mesures préventives réduit considérablement les complications au niveau des pieds.      Soins des pieds  Lavez vos pieds à l’eau tiède avec un savon doux.  Asséchez-les bien, surtout entre et sous les orteils.  Évitez les bains de pieds de plus de 10 minutes. Appliquez tous les jours une lotion ou une crème hydratante, non parfumée, en couche mince si votre peau est sèche. Évitez d’en appliquer entre les orteils. Examinez attentivement vos pieds, sous un éclairage suffisant, afin de détecter toute callosité, fissure, blessure, ampoule, rougeur ou coloration anormale.  Si votre vue est diminuée ou si vous manquez de souplesse, utilisez un miroir ou demandez de l’aide.  Soins des ongles  Après la douche ou le bain, installez-vous confortablement.  Limez le bord de l’ongle avec une lime d’émeri, toujours dans le même sens afin d’éviter tout mouvement de va-et-vient.  L’ongle ne devrait jamais être plus court que le bout de l’orteil. Évitez de couper vos ongles avec un coupe-ongles ou tout autre instrument tranchant. Si vos ongles sont épais, incarnés ou présentent une forme anormale, consultez une infirmière ou un infirmier en soins podologiques ou bien un ou une podiatre.  Soins des callosités  N’appliquez jamais de diachylons à base d’emplâtres d’acide salicylique, de liquides ou d’onguents spéciaux. Après la douche ou le bain, utilisez une pierre ponce ou une lime d’exfoliation sur une peau humide.  Humidifiez toujours la pierre ponce.  Frottez doucement, toujours dans le même sens en évitant tout mouvement de va-et-vient.  N’essayez pas d’enlever toutes les callosités en une seule fois. Consultez, au besoin, une infirmière ou un infirmier en soins podologiques, un ou une podiatre ou votre médecin.  Examen annuel Faites examiner vos pieds par votre médecin, une infirmière ou un infirmier en soins podologiques ou bien un ou une podiatre au moins une fois par année, et plus souvent s’il y a risque ou présence de complications. Cet examen comprend un test de sensibilité à l’aide d’un petit dispositif muni d’un fil, appelé monofilament. Bas et chaussures  Portez des bas de coton, blancs ou de couleur pâle, bien ajustés et évitez les élastiques qui compriment la circulation et les coutures qui font pression sur la peau.  Changez-les tous les jours, lavez-les à l’envers et séchez-les à l’air chaud. Portez des chaussures souples et confortables dès l’achat.  Achetez-les en fin de journée alors que vos pieds sont plus enflés. La semelle doit être souple et le talon ne doit pas excéder 5 cm (2 po).  Avant de les enfiler, vérifiez l’intérieur des chaussures avec la main afin de déceler la présence d’un petit objet (ex. : roche, clou, clé) ou encore une déchirure ou un faux pli de la doublure. Portez toujours des sandales en caoutchouc dans les lieux publics tels que les piscines, les plages et les douches.  Ne marchez jamais pieds nus. Consultez au besoin un ou une podiatre ou un ou une orthésiste pour des chaussures faites sur mesure.  En cas de blessure  Nettoyez la blessure à l’eau tiède avec un savon doux non parfumé. Rincez et épongez doucement. Recouvrez la blessure d’un pansement sec en prenant soin de ne pas serrer le pied. N’appliquez pas d’onguent antibiotique sans prescription médicale. Lorsque vous êtes assis, élevez votre jambe sur un tabouret afin de favoriser la circulation du sang. Évitez de marcher sur la blessure. Vérifiez-la chaque jour afin de détecter la présence de signes d’infection tels que rougeur, chaleur au toucher, enflure, odeur particulière ou écoulement. Si tel est le cas, consultez un ou une médecin dans les plus brefs délais.  Douleur Consultez votre médecin ou présentez-vous dans une clinique sans rendez-vous pour une évaluation et pour vérifier la possibilité de vous prescrire une médication analgésique. Circulation sanguine Portez des bas de laine si vos pieds sont froids.  N’utilisez jamais de bouillotte ou de coussin chauffant directement sur vos pieds.  Protégez-vous du froid afin d’éviter les engelures.Bougez souvent vos orteils et faites des mouvements circulaires avec les chevilles."]
        },
        {
            "tag": "skin_care",
            "patterns": ["Soin de la peau", "Qu'est ce que le soin de la peau", "Soin de la peau et diabète"],
            "responses": ["Plusieurs personnes diabétiques éprouvent des problèmes d’assèchement de la peau. Ce problème est plus fréquent chez les personnes dont le diabète est mal contrôlé, parce qu’en hyperglycémie, le corps « soutire l’eau », faisant uriner davantage. La peau se déshydrate et devient sèche. La peau peut également être plus sèche en raison d’une insuffisance circulatoire ou d’une atteinte du système nerveux pouvant entrainer une diminution des glandes responsables de la transpiration. Enfin, d’autres facteurs, non spécifiques à la personne diabétique, tels l’exposition au soleil et l’utilisation de produits irritants ou parfumés peuvent contribuer à l’assèchement de la peau.      Conseils pour prévenir la sécheresse de la peau  Maintenez un bon contrôle de votre diabète en gardant vos glycémies le plus près possible des valeurs normales. Évitez l’eau très chaude, qui favorise la peau sèche. Utilisez un savon doux, non parfumé. Assurez-vous d’enlever toute trace de savon. La douche est préférable au bain pour déloger la saleté ou les traces de savon. Essuyez bien la peau en tapotant avec une serviette douce plutôt qu’en frottant vigoureusement. Appliquez une lotion ou crème hydratante hypoallergénique et non parfumée. L’application d’une couche mince suffit. Un excès de crème peut entrainer une trop grande humidité et, par conséquent, la macération de la peau. Le contact avec certains détergents ou autres produits chimiques peut faire disparaitre les huiles naturelles de la peau. Il est conseillé de porter des gants lors de la manipulation de ces produits. Soyez actif. L’activité physique stimule la circulation sanguine, favorise le contrôle du diabète et procure un sentiment de bien-être. Buvez suffisamment tout au long de la journée. Prenez certaines précautions additionnelles lors des journées ensoleillées : Évitez l’exposition au soleil sans protection, surtout entre 10 heures et 16 heures. Appliquez une crème solaire et un baume à lèvre avec FPS, environ 30 minutes avant l’exposition au soleil et chaque deux heures par la suite. Pour la baignade, utilisez des crèmes solaires hydrofuges. Méfiez-vous des journées nuageuses et venteuses. Les rayons du soleil peuvent traverser les nuages et le brouillard."]
        },
        {
            "tag": "selfchecking_glycemi",
            "patterns": ["Autosurveillance de la glycémie", "Qu'est ce que l'autosurveillance de la glycémie", "Que sait tu de l'autoserveiilance de la glycémie", "Autosurveillance de la glycémie et diabète"],
            "responses": ["L’autosurveillance de la glycémie est l’approche par laquelle la personne vivant avec le diabète mesure elle-même son taux de sucre dans le sang (glycémie) à l’aide d’un glucomètre, ou dans le liquide interstitiel (système de surveillance continue du glucose (SCG)).     Vidéo: Comment prendre sa glycémie et comprendre les capteurs de glycémie        Glycémie capillaire      La glycémie capillaire est une méthode de surveillance du glucose sanguin. La personne vivant avec le diabète peut mesurer elle-même son taux de sucre dans le sang (glycémie) à l’aide d’un lecteur de glycémie (glucomètre). À partir des résultats obtenus, elle peut ajuster ou vérifier l’effet de ses habitudes et de son traitement (alimentation, activité physique, insuline, médicaments, gestion du stress, etc.).  Avantages La personne vivant avec le diabète peut percevoir l’autosurveillance comme une contrainte pour plusieurs raisons : matériel à transporter, se piquer parfois plusieurs fois par jour, sentiment de frustration ou d’anxiété face à certains résultats inattendus. Toutefois, en comprenant les avantages de l’autosurveillance, on réalise qu’elle est très utile pour la gestion de son diabète. L’autosurveillance permet :  De vérifier l’impact des différents éléments du traitement sur votre glycémie et de faire les ajustements, au besoin. De compléter l’information fournie par l’hémoglobine glyquée (A1c). D’identifier, de traiter sans délai et de prévenir l’hypoglycémie de même que l’hyperglycémie. De développer un sentiment de confiance, de sécurité et d’autonomie.  Pour bénéficier des avantages de l’autosurveillance, il est essentiel que vous receviez un enseignement par un professionnel de la santé portant sur:  Les aspects techniques de l’autosurveillance; Les cibles de glycémie; Le moment et la fréquence des mesures de la glycémie; Les mesures à prendre en fonction des résultats obtenus; Une réévaluation des moments et de la fréquence de l’autosurveillance tous les 3 à 6 mois en fonction de votre état de santé et des résultats.  Sans ces informations, l’autosurveillance de la glycémie n’offrira pas son plein potentiel et pourrait affecter votre motivation et l’atteinte de vos objectifs.    Mesurer sa glycémie: Enseignement et matériel La première étape consiste à rencontrer un professionnel de la santé. Après avoir identifié vos besoins, il vous suggérera un lecteur de glycémie que vous pourrez vous procurer en pharmacie ainsi que tout autre matériel nécessaire pour l’autosurveillance. Voici le matériel nécessaire pour procéder à la mesure de sa glycémie:  Glucomètre (appareil); Lancettes (aiguilles); Autopiqueur (appareil où l’aiguille est insérée); Bandelettes réactives (où l’on dépose la goutte de sang).  Par la suite, vous apprendrez la marche à suivre pour mesurer adéquatement votre glycémie :  Se laver les mains à l’eau savonneuse et bien les assécher. Insérer une bandelette réactive dans le lecteur de glycémie. Insérer une lancette neuve dans l’autopiqueur*. Piquer le bout du doigt (partie latérale). Presser doucement le bout du doigt, au besoin. Mettre le sang en contact avec la bandelette réactive. Attendre quelques secondes (temps variable selon le lecteur). Lire et inscrire le résultat dans un carnet, une application ou le sauvegarder dans le lecteur de glycémie. Jeter la lancette dans un contenant pour déchets biomédicaux (disponibles en pharmacie).  *Utiliser une lancette neuve à chaque utilisation.      Moment et fréquence de la mesure de la glycémie capillaire Le moment et la fréquence de l’autosurveillance sont déterminés selon le type de diabète, du traitement prescrit, du risque d’hypoglycémie et de la capacité de la personne à comprendre les notions enseignées. Ils varient donc d’une personne à l’autre.  SituationMoment et fréquence recommandés de l’autosurveillancePersonne traitée avec 4 injections ou plus d’insuline par jour ou avec une pompe à insulineAu moins 4 mesures de glycémie par jour (avant les repas, au coucher et dans certaines circonstances, 2 heures après les repas et lors de toute autre situation présentant un risque d’hypoglycémie)Personne traitée avec moins de 4 injection d’insuline par jourAu moins 1 mesure de glycémie aux moments où l’insuline est priseCibles glycémiques non atteintesAu moins 2 fois par jour, aide aux changements de comportements et/ou changement de médication jusqu’à ce que les cibles glycémiques soient atteintes.Nouveau diagnostic de diabète (moins de 6 mois)Au moins une fois par jour à différents moments de la journée pour comprendre les effets de l’alimentation, l’activité physique et la médication sur la glycémie.Seul traitement du diabète est la modification des habitudes de vie et des médicaments antihyperglycémiants, sans insuline, ET  cibles glycémiques atteintesMesures occasionnelles (une à deux fois par semaine) pour s’assurer que les cibles glycémiques sont atteintes chez certaines personnes.PrédiabèteMesure de la glycémie généralement non recommandée Certaines situations particulières peuvent exiger que la personne vivant avec un diabète mesure sa glycémie plus souvent. Ces situations sont généralement les suivantes et doivent être discutées avec l’équipe de soins :  Le début d’un nouveau traitement; La planification d’une grossesse ou une grossesse en cours; La pratique d’un métier nécessitant une surveillance accrue de la glycémie; Une maladie ou une condition médicale pouvant affecter le contrôle de la glycémie; Le début d’une prise de médicaments hyperglycémiants (cortisone, etc.).  Comment savoir si le résultat est fiable?  Vérifier le bon fonctionnement du glucomètre:  Tester le glucomètre avec la solution de contrôle (consulter le pharmacien ou la compagnie si la solution n’est pas fournie avec le glucomètre). Prendre sa glycémie à jeun lors d’une prise de sang pour comparer les résultats (consulter un professionnel pour connaître la différence acceptable entre les deux). Vérifier s’il y a de la poussière ou du sang séché à l’endroit où l’on insère la bandelette. S’assurer que le lecteur n’a pas été exposé à l’humidité ou à une température inférieure à 5° C ou supérieure à 30° C. S’assurer que le lecteur n’a pas été échappé. S’assurer que le glucomètre n’a pas été en contact direct avec les rayons du soleil. S’assurer que le glucomètre n’a pas été en contact avec des liquides.   Vérifier l’état des bandelettes:  S’assurer que la date d’expiration n’est pas atteinte ou dépassée. Conserver les bandelettes dans leur contenant d’origine. Conserver à l’abri de l’humidité à une température entre 4 et 30° C. Fermer le contenant après avoir pris une bandelette. S’assurer qu’elles ne sont pas contaminées par la poussière ou d’autres substances.    Aussi, n’oubliez pas de respecter les conditions d’utilisation du glucomètre.         Système de surveillance continue du glucose (SCG)      Il existe deux type de système de surveillance continue du glucose :  En temps réel; Par balayage intermittent.  Il s’agit d’un système qui capte le glucose situé dans le liquide interstitiel, soit le liquide situé entre les cellules du corps et les capillaires sanguins. Fonctionnement Un capteur est inséré sous la peau et reste en place de 10 à 14 jours, selon le système. Il est donc possible d’obtenir un nombre illimité de données sur le taux de glucose. Pour le système par balayage intermittent, il suffit d’ouvrir l’application du fabricant et passer le téléphone intelligent ou le lecteur jusqu’à 4 cm du capteur pour obtenir une lecture du glucose. Pour le système en temps réel, les données sont directement envoyées dans l’application du fabricant installée sur le téléphone intelligent ou le lecteur. Ces systèmes peuvent être utilisés avec une pompe à insuline pour créer un système de pancréas artificiel (système à boucle fermée). Avec le pancréas artificiel, la pompe à insuline ajuste automatiquement le débit d’insuline selon le résultat de glucose capté par le système de SCG, et transmis à la pompe via un émetteur. Est-ce fiable? Certains de ces systèmes sont assez fiables pour prendre des décisions dans la gestion du diabète. Il existe toutefois un décalage d’environ 5 minutes entre la valeur sanguine et la valeur donnée par le système. En cas de valeurs qui ne concordent pas avec les symptômes ressentis, il demeure préférable de prendre sa glycémie capillaire. À qui s’adressent ces systèmes? Bien que toutes les personnes vivant avec le diabète puissent en bénéficier, les personnes traitées à l’insuline (diabète de type 1 et certaines personnes vivant avec le diabète de type 2) sont celles dont les bénéfices ont été le plus clairement établies. Certains systèmes sont couverts par la RAMQ selon certaines conditions. Parlez-en à votre professionnel de la santé. Avantages Pour bénéficier des avantages de la SCG, il faut vouloir utiliser le système, mais aussi être en mesure de pouvoir l’utiliser, que ce soit au niveau des capacités physiques, de la compréhension du système, et de l’aspect financier.  Chez les personnes vivant avec le diabète de type 1, certaines études ont montré que l’utilisation de la SCG permettait de:  Diminuer le taux d’HbA1C (SCG en temps réel); Augmenter le temps passé dans l’intervalle cible; Diminuer la durée et la fréquence des épisodes d’hypoglycémie; Améliorer la satisfaction face au traitement.  Chez les personnes vivant avec le diabète type 2, l’utilisation de la SCG permettrait de:  Diminuer la durée des épisodes d’hypoglycémie; Diminuer le taux d’HbA1C (SCG en temps réel).          Où jeter vos aiguilles?      Le risque de contracter une infection (VIH/sida, hépatite B ou hépatite C) par une piqûre accidentelle est faible. Il est tout de même important de disposer des lancettes usagées de façon sécuritaire.   Qu’est-ce que le SIRSAU ? Mis en place en 2006 par le Ministère de la Santé et des Services sociaux du Québec, le système intégré de récupération des seringues et des aiguilles usagées (SIRSAU) offre gratuitement des contenants jaunes de récupération à des personnes, dont les personnes diabétiques, faisant usage de seringues, aiguilles ou lancettes, à domicile, dans le cadre d’un traitement.       Où se procurer les contenants de récupération ? Pour les personnes diabétiques, des contenants de 1,4 L sont offerts dans certaines pharmacies, cliniques externes de diabète ou centres d’enseignement pour personnes diabétiques. Les contenants de format 5 L ne sont plus offerts dans le cadre du programme SIRSAU. Cependant, il est possible de s’en procurer moyennant des frais dans certaines pharmacies. Les centres d’hébergement publics ou privés doivent fournir, à leurs frais, des contenants à leurs résidents. Où se départir des contenants de récupération lorsqu’ils sont pleins? Les CLSC et les pharmacies ayant adhéré au programme SIRSAU peuvent reprendre gratuitement les contenants jaunes de récupération une fois pleins. Le contenant est-il sécuritaire ? Le contenant correspond aux normes canadiennes. Il permet l’entreposage et le transport sécuritaire d’objets piquants ou tranchants, tels des lancettes ou des aiguilles. Le nouveau modèle de contenant est doté d’un dispositif de fermeture temporaire (appuyer légèrement sur le couvercle – un clic) et permanente (appuyer fermement sur le couvercle – deux clics). Ces instructions sont gravées en français et en anglais sur le contenant. Dès qu’un objet piquant ou tranchant est placé à l’intérieur, le système de fermeture temporaire doit toujours être activé afin d’éviter que le contenu se renverse. Où doit-on conserver le contenant ? Le contenant doit être conservé hors de portée des enfants, comme c’est le cas pour les médicaments. Que peut-on mettre dans le contenant ? Le contenant jaune ne sert qu’à récupérer les objets piquants ou tranchants. Il est donc recommandé aux personnes diabétiques de placer uniquement les lancettes et les aiguilles (sans le dispositif d’injection) dans le contenant de récupération. Que faut-il éviter de mettre dans le contenant ? La seringue ou le stylo injecteur complet, la cartouche ou la fiole d’insuline, le dispositif de perfusion de la pompe à insuline, les bandelettes réactives et le coton alcoolisé peuvent être jetés avec les ordures ménagères puisque ce ne sont pas des objets piquants ou tranchants."]
        },
        {
            "tag": "insulin_pump",
            "patterns": ["La pompe à insuline", "Qu’est-ce que la pompe à insuline?", "Que sait tu de la pompe à insuline", "Pompe à insuline et diabète"],
            "responses": ["Le traitement par pompe à insuline est une forme d’insulinothérapie intensive qui ne nécessite pas de multiples injections d’insuline. Un appareil à piles de la taille d’un téléavertisseur, appelé pompe à insuline, est porté sur soi en tout temps et libère continuellement de l’insuline à action rapide. L’appareil permet également d’administrer au besoin des doses supplémentaires (bolus) d’insuline, sur commande de son utilisateur.   Saviez-vous que la pompe à insuline est utilisée depuis plus de 20 ans?   Le mode de fonctionnement Il existe deux grandes catégories de pompe sur le marché actuellement: La pompe avec tubulure qui relie la pompe au cathéter qui infuse l’insuline dans les tissus sous-cutanés, et la pompe avec dispositif de type « pod » qui est un dispositif collé directement sur la peau et qui infuse l’insuline par le cathéter inséré sous la peau. Dans les deux cas, l’ensemble complet de perfusion (réservoir, tubulure, cathéter ou pod) doit être changé tous les 2 ou 3 jours. La pompe à insuline tente d’imiter le fonctionnement d’un pancréas normal, en libérant une dose d’insuline basale et des bolus aux repas ou lorsque la glycémie augmente de façon inhabituelle. Par contre, à la différence du pancréas, elle ne libère pas automatiquement une quantité d’insuline variable en fonction de la glycémie ou de ce qui a été mangé. L’utilisateur, avec l’aide de son équipe de soins, doit lui-même programmer les doses. Par conséquent, il doit surveiller sa glycémie de près et calculer avec précision la quantité de glucides consommés afin d’ajuster les doses d’insuline à administrer. Mais la technologie évolue constamment et il existe maintenant sur le marché de nouveaux systèmes de pompes à insuline qu’on appelle les pompes automatisées. Ces nouveaux systèmes de  pompes à insuline ajustent automatiquement l’administration d’insuline basale en fonction des lectures provenant de la surveillance du glucose en continu (SGC) afin d’augmenter le temps passé dans une plage saine et de diminuer les épisodes d’hypoglycémie et d’hyperglycémie. Le patient doit seulement entrer les glucides consommés lors  des repas et à répondre aux mesages-guides du système.  Les avantages et les risques Les avantages Un meilleur contrôle glycémique Des études menées auprès d’enfants et d’adultes diabétiques ont démontré que le traitement par pompe à insuline offrait généralement un meilleur contrôle de la glycémie que le traitement par injections multiples, réduisant les hausses et les chutes de glycémie. Une plus grande liberté Un autre des principaux avantages réside dans la liberté qu’offre la pompe à insuline sur le plan du mode de vie. Cet avantage est encore plus appréciable chez les enfants et les adolescents, qui ont souvent un horaire de vie très variable. L’utilisateur peut décider spontanément du moment et de la dose de l’administration d’insuline.      Un service d’assistance, en cas de bris de la pompe ou autre problème technique, permet à l’utilisateur de réagir rapidement en cas de situation inhabituelle.   Les risques Problème mécanique La pompe à insuline libère de l’insuline à action rapide, dont l’effet ne dure que trois ou quatre heures. Toute interruption non planifiée de l’administration de l’insuline pourrait occasionner une hyperglycémie, voir même une acidocétose diabétique , si plusieurs heures s’écoulent avant que l’utilisateur corrige la situation. Cela peut arriver si la tubulure est pliée ou bloquée, la pompe déplacée, ou encore si l’utilisateur oublie de changer la cartouche vide d’insuline ou la pile épuisée. Toutefois, ce risque peut être éliminé grâce à des alarmes préprogrammées reliées à la pompe et en vérifiant fréquemment sa glycémie pour détecter toutes variations anormales. Le risque d’infection Si la canule demeure trop longtemps sous la peau, cela peut causer des infections. Par contre, en changeant la canule à la fréquence indiquée (habituellement tous les deux ou trois jours) en employant la bonne technique et en nettoyant bien la peau, ce risque peut être évité. Un traitement qui convient à tous? La pompe à insuline peut s’avérer un excellent moyen de gérer le diabète, mais, bien sûr, elle ne fait pas disparaître la maladie. Elle exige une vigilance accrue, pour des raisons de sécurité et d’efficacité. Le traitement par pompe à insuline nécessite une implication importante de la personne diabétique.      Le traitement par pompe à insuline nécessite une implication importante de la personne diabétique.   Le candidat idéal devrait:  bien connaître son diabète comprendre l’impact de l’alimentation, de l’activité physique, du stress et de l’insuline sur le contrôle glycémique accepter de mesurer sa glycémie au moins quatre fois par jour (et souvent plus) et tenir un registre des résultats être apte et prêt à apprendre le calcul des glucides de façon précise (méthode avancée) être suivi par un professionnel de la santé (médecin ou éducateur en diabète) qui connait le fonctionnement de la pompe à insuline et qui est facile à contacter accepter de porter ce dispositif en tout temps et d’en faire l’entretien régulier (changement du dispositif de perfusion, etc.)  À l’initiation du traitement, il faut également être disposé à un suivi étroit avec son équipe de soin, nécessaire pour déterminer les débits de base et les bolus requis. La personne diabétique doit aussi suivre une formation et réapprendre à gérer son diabète avec la pompe à insuline. Si ce type de traitement vous intéresse, discutez-en avec votre équipe de soins qui pourra vous aider à prendre une décision éclairée. Les coûts La pompe à insuline coûte environ 7000 $ et il faut prévoir entre 1500$ et 3000$ par année pour les fournitures (cartouches d’insuline, dispositif de perfusion (canule et tubulure), bandelettes, piles, etc.). Les nouveaux systèmes de pompes à insuline (pompes automatisées) peuvent être plus dispendieuses dû à la présence du lecteur de glycémie en continu (SGC). Au Québec, depuis 2011, la pompe est remboursée par la Régie de l’assurance maladie du Québec (RAMQ) chez les personnes âgées de moins de 18 ans qui répondent à certains critères cliniques. L’accès à ce programme se poursuit après l’âge de 18 ans pour ceux qui y ont adhéré avant cet âge, depuis l’instauration du programme en 2011. Pour plus d’information sur le programme d’accès aux pompes à insuline, visitez le site Internet de la RAMQ. Certains régimes d’assurances collectives assument une partie des coûts de la pompe à insuline et des fournitures sur réception d’une lettre d’un médecin attestant de sa nécessité sur le plan médical.  Adapté de : Lawson Margaret et Caron Daniel (2001). Le traitement par pompe à insuline vous convient-il? Plein Soleil, Diabète Québec, p. 18-20; René Jennifer et Desjardins Katherine (2016-2017). Le point sur le traitement par pompe à insuline. Plein Soleil. Diabète Québec, p. 18-21. Septembre 2014 (mise à jour Janvier 2019) Références : Geoffroy L. et Gonthier M. (2012). L’insulinothérapie par pompe sous-cutanée. Dans Le diabète chez l’enfant et l’adolescent, 2e édition. Montréal :Éditions du CHU Ste-Justine Ministère de la Santé et des Services sociaux du Québec (2014). Programme d’accès aux pompes à insuline [En ligne]. Repéré à https://www.quebec.ca/sante/problemes-de-sante/a-z/diabete/programme-d-acces-aux-pompes-a-insuline/ (page consultée en janvier 2019). Santé Canada (2012). Pompes à insuline [En ligne]. Repéré à http://www.hc-sc.gc.ca/hl-vs/iyh-vsv/med/pumps-insulin-pompes-fra.php#a2 (page consultée le 5 août 2014)"]
        },
        {
            "tag": "app",
            "patterns": ["Applications pour faciliter le calcul des glucides", "Connais tu des applications pour faciliter le calcul des glucides", "Quelles applications pour faciliter le calcul des glucides"],
            "responses": ["Voici une liste non exhaustive d’applications pour téléphones intelligents pour faciliter le calcul des glucides: Carbs and Cal ($) : Propose des images de différents formats d’aliments et de plats. En anglais seulement. CalorieKing: Permet de connaître la valeur nutritive de plusieurs aliments. Inclut également une base de données sur des mets de chaînes de restaurants américains. En anglais seulement. Cronometer: Permet, entre autres, de connaître la valeur nutritive de milliers d’aliments et de faire le calcul de la valeur nutritive de recettes. En anglais seulement. Figwee ($) : Propose des images de différents formats d’aliments et de plats. En anglais seulement. Gluci-Check (Roche Diabetes Care France): Un outil de calcul des glucides avec visualisation des portions dans l’assiette. MyFitnessPal: Permet de connaître la valeur nutritive de plusieurs aliments. Nutriments Canada ($) : Permet de connaître la valeur nutritive de plusieurs aliments dont la base de données est le Fichier canadien sur les éléments nutritifs.       N.B. Diabète Québec ne se porte pas garante de l’exactitude du contenu de ces applications."]
        },
        {
            "tag": "natural_health_products",
            "patterns": ["Produits de santé naturels", "Parle moi des produits de santé naturels pour le diabète", "Produits de santé naturels et diabète"],
            "responses": ["Nombreux sont ceux qui consomment des produits de santé naturels à divers effets. Il est normal de vouloir essayer différents remèdes en présence d’une maladie, mais les traitements médicamenteux classiques dont les effets sont confirmés – et qui sont régis par une règlementation stricte en matière d’efficacité et d’innocuité – demeurent le choix à privilégier. Qu’est-ce qu’un produit de santé naturel (PSN)? Un produit de santé naturel peut être :  une plante, une matière végétale ou un extrait de ceux-ci des vitamines et minéraux des acides aminés des acides gras essentiels (exemple : oméga-3) etc.  Un manque de rigueur À ce jour, les preuves sont insuffisantes quant à l’efficacité et à l’innocuité des PSN pour permettre de les recommander dans le traitement du diabète, contrairement aux médicaments classiques dont les effets ont été démontrés par nombre d’études scientifiques rigoureuses. Certains PSN semblent prometteurs, mais des études plus approfondies sont nécessaires pour en confirmer les effets. Aussi, la règlementation pour les produits de santé naturels est moins stricte que pour les médicaments et la pureté du produit est parfois inconnue. Les mises en garde Si vous souhaitez tout de même faire l’utilisation des produits de santé naturels, voici quelques mises en garde à considérer :  Faites preuve de prudence : « naturel » ne veut pas dire « inoffensif » et il reste important de bien s’informer des effets possibles sur la santé. Vérifiez que l’information sur les possibles bénéfices du produit provient d’une source fiable (site Internet crédible avec références, professionnel de la santé, etc.). Parlez-en à votre médecin ou à votre pharmacien pour connaître les éventuels effets secondaires ou interactions possibles avec votre médication de base, ou pour les contre-indications en lien avec votre état de santé. Si vous décidez d’en faire l’utilisation, mesurez votre glycémie plus souvent afin d’en vérifier l’impact.  Les produits de santé naturels ne peuvent remplacer la médication. Personnes vivant avec le diabète de type 1 Les personnes vivant avec le diabète de type 1 dépendent du traitement à l’insuline parce que leur pancréas ne produit pas d’insuline : il est dangereux, voire mortel, de remplacer ce traitement par une médecine douce ou un produit de santé naturel. Personnes vivant avec le diabète de type 2 Le pancréas des personnes vivant avec le diabète de type 2 produit encore de l’insuline. Il y a donc plus de chances qu’un traitement complémentaire fonctionne, mais aucune étude concluante n’existe pour le moment. Le point sur certains PSN La cannelle Cela fait déjà plusieurs années que ses effets sur la glycémie des personnes diabétiques de type 2 sont à l’étude. Cependant, les résultats d’études d’une durée minimale de 3 mois font état de résultats contradictoires sur le taux de A1c. Il en est de même pour les études sur le magnésium, les acides gras oméga-3, les probiotiques et le zinc. Le ginseng Le ginseng est un produit de santé naturel extrait de la racine d’une plante qui compte plusieurs variétés, dont les plus populaires sont les ginsengs américains et asiatiques et dont les effets peuvent différer. Dans la médecine chinoise, le ginseng est utilisé pour traiter :  l’anémie les dysfonctions érectiles le diabète plusieurs autres maladies  La méthodologie des études réalisées afin de vérifier l’effet du ginseng sur la glycémie était inadéquate et le nombre de participants insuffisant pour permettre de tirer des conclusions. De même, on ne connaît pas l’effet à long terme de la prise du ginseng sur les glycémies, ni si un phénomène de tolérance peut se manifester, à savoir que l’on pourrait assister à une diminution de l’efficacité de la plante après quelques prises. Il existe de nombreux effets indésirables reliés à la consommation du ginseng :  insomnie nervosité augmentation et diminution de la tension artérielle palpitations maux de tête diarrhée  Il est contre-indiqué chez :  les enfants et les femmes enceintes ou allaitantes les personnes ayant des problèmes cardiaques ou de coagulation, atteintes d’un cancer hormono-dépendant, ou atteintes de schizophrénie  Il est recommandé de vérifier avec votre pharmacien si le ginseng a une interaction avec vos autres médicaments, dont :  l’insuline et les médicaments antihyperglycémiants les anticoagulants ou antiplaquettaires les diurétiques les médicaments pour le traitement de l’insuffisance cardiaque certaines hormones les antipsychotiques  Le chrome Le chrome est un minéral essentiel que l’on retrouve naturellement dans plusieurs aliments. Les aliments les plus riches en chrome sont la levure de bière et le foie de veau. Le brocoli, les haricots verts, les pommes de terre, les céréales à grains entiers, le germe de blé, le gruyère, les prunes, les champignons, les asperges, les viandes, les jaunes d’œufs et la bière en contiennent aussi des quantités intéressantes. Le chrome est vendu sous forme de supplément depuis des années comme adjuvant à la perte de poids, pour améliorer l’humeur, l’énergie, la vision et l’acné, mais son efficacité reste à prouver. Bien que son mécanisme d’action exact soit toujours incompris, on croit que le chrome pourrait améliorer l’action de l’insuline présente dans l’organisme, d’où son intérêt dans le diabète de type 2. Il serait par contre inefficace dans le diabète de type 1. D’autres sources affirment également que le chrome alimentaire ou en supplément diminuerait les triglycérides et le C-LDL (le « mauvais » cholestérol), tout en augmentant les C-HDL (le « bon » cholestérol). Les résultats des études scientifiques effectuées sont contradictoires quant à son effet. Autre obstacle : la dose de chrome utilisée au cours des études était cinq fois plus élevée que les doses quotidiennes recommandées et reconnues sécuritaires. Aussi, des effets indésirables importants suite à la prise de chrome ont été rapportés :  problèmes de peau troubles du foie atteinte grave des reins  La glucosamine Certains l’utilisent pour le traitement de l’arthrose, en combinaison d’un traitement pharmacologique. À l’inverse des précédents produits de santé naturels, la glucosamine aurait un possible effet hyperglycémiant. Cet effet de la glucosamine demeure controversé, mais la prudence est de mise. Malgré son nom, la glucosamine n’est pas une source de glucose (sucre), mais les personnes diabétiques doivent rester prudentes :  Lorsqu’on utilise la glucosamine, le foie peut produire plus de glucose et augmenter la glycémie. La glucosamine diminue l’activité d’une enzyme dans le corps (la glucokinase) qui sert à contrôler la production de glucose par le foie. Chez le rat, la glucosamine pourrait diminuer la sécrétion d’insuline par le pancréas. Elle pourrait augmenter la résistance à l’insuline à long terme, donc accélérer le processus de progression du diabète de type 2. Une étude effectuée in vitro a démontré que la glucosamine a engendré une destruction de cellules du pancréas, mais les doses étaient de 5 à 10 fois plus élevées que ce qui est recommandé par le fabricant et il n’y a pas eu d’étude sur l’humain. Il semblerait qu’aux doses recommandées par le fabricant pour traiter l’arthrose, la glucosamine n’ait pas d’effet délétère sur la glycémie et la résistance à l’insuline, mais il manque d’études cliniques sur le sujet pour le confirmer.  Malheureusement, aucune étude n’a jusqu’à maintenant été assez longue pour vérifier l’effet réel du produit sur la glycémie à moyen ou long terme. On ne connaît pas encore les conséquences à long terme sur le diabète. Les produits offerts sur le marché peuvent contenir différents ingrédients en plus de la glucosamine. Souvent les quantités de ces produits ne sont pas écrites sur le contenant puisqu’il n’existe pas de réglementation à ce sujet. Par exemple, certains comprimés contiennent du sodium pouvant être nuisible pour les patients souffrant d’hypertension. D’autres contiennent du potassium et du magnésium, pouvant être néfastes pour les gens ayant des problèmes de reins. En conclusion, il n’existe pas d’études à ce jour ayant confirmé l’impact positif de l’utilisation de certains produits naturels sur la glycémie. Il faudra attendre les résultats d’études longitudinales à larges échelles avant de confirmer leur potentiel."]
        },
        {
            "tag": "body_vs_alcohol",
            "patterns": ["Votre corps et l’alcool", "Quel effet de l'alcool sur mon corps", "Alcool et diabète", "Est ce que l'alcool est nuisible", "Quelle quantité d’alcool puis-je boire?"],
            "responses": ["Lorsqu’on boit de l’alcool, c’est le foie qui s’occupe de l’éliminer en mettant en suspens ses autres tâches comme celle d’ajuster le taux de sucre dans le sang (glycémie). Cela affecte le contrôle de la glycémie.  Il est important de surveiller plus souvent sa glycémie lors de la consommation d’alcool. L’alcool peut faire monter le taux de sucre (hyperglycémie) si la boisson consommée contient beaucoup de glucides. L’alcool peut aussi faire baisser le taux de sucre (hypoglycémie), parce qu’il empêche le foie de produire du sucre quand les aliments n’en fournissent pas suffisamment. Ce phénomène risque de se produire si l’alcool est consommé seul, en apéritif par exemple. Les personnes vivant avec le diabète qui prennent de l’insuline ou des médicaments sécrétagogues de l’insuline* sont particulièrement à risque d’hypoglycémie. * Sécrétagogues de l’insuline : gliclazide (DiamicronMDet Diamicron MRMD), glimépiride (AmarylMD), glyburide (DiabetaMD),  répaglinide (GlucoNormMD). Les Lignes directrices de pratique clinique 2018 de Diabète Canada pour la prévention et le traitement du diabète au Canada recommandent aux personnes vivant avec le diabète une consommation d’alcool limitée, basée sur les mêmes recommandations que pour la population générale: Femmes : 2 consommations maximum par jourMoins de 10 consommations par semaine Hommes : 3 consommations maximum par jourMoins de 15 consommations par semaine Il est également recommandé de ne pas boire tous les jours. Une consommation d’alcool équivaut à : 340 mL (12oz) de bière à 5% d’alcool140 mL (5 oz) de vin (rouge ou blanc) à 12% d’alcool85 mL (3 oz) de vin fortifié (ex.: porto) à 20% d’alcool45 mL (1,5 oz) de spiritueux à 40% d’alcool Si vous souffrez d’hypertension, avez un taux élevé de triglycérides (gras) dans le sang, des problèmes de foie ou neurologiques, il vaut mieux limiter votre consommation d’alcool. En cas de doute, consultez votre médecin ou votre pharmacien(ne) pour connaître vos propres limites à ne pas dépasser en matière d’alcool."]
        },
        {
            "tag": "hyperglycemia_and_alcohol",
            "patterns": ["Hypoglycémie: Quelques conseils préventifs pour les personnes à risque", "Puis-je boire de l’alcool si je suis à risque d’hypoglycémie?", "Quelques conseils préventifs pour les personnes à risque d’hypoglycémie"],
            "responses": ["Boire l’alcool lentement; Ne jamais boire l’estomac vide et avoir un supplément de sucre avec soi;Informer les gens qui vous accompagnent que les symptômes d’hypoglycémie peuvent ressembler à ceux de l’ivresse et quoi faire en cas de problème;Mesurer sa glycémie plus souvent. Ne pas oublier de le faire au coucher;Prendre une collation supplémentaire au coucher, au besoin pour prévenir l’hypoglycémie nocturne;S’assurer de se lever à l’heure habituelle pour déjeuner le lendemain d’une soirée arrosée;Éviter l’alcool avant, pendant et après une activité physique."]
        },
        {
            "tag": "imc",
            "patterns": ["L’indice de masse corporelle (IMC)", "Qu'est ce que l'indice de masse corporelle", "IMC et diabète", "Indice de masse corporelle et diabète"],
            "responses": ["L’IMC est le rapport du poids sur la taille au carré: IMC = Poids (kg) / Taille (m2) Il donne un indice quant au risque de développer une maladie chronique, entre autres, le diabète. On l’utilise chez les individus de 18 ans et plus. Cet indicateur est à prendre avec un grain de sel chez les athlètes ou les personnes avec une forte musculature, chez qui l’IMC peut être surestimé. Si votre IMC est de…Cela pourrait indiquer…18,4 et moinsun poids insuffisantde 18,5 à 24,9un poids santé*de 25 à 29,9de l’embonpointde 30 et plusde l’obésité *Pour les personnes de 65 ans et plus, l’intervalle « poids santé » peut aller d’une valeur légèrement supérieure à 18,5 jusqu’à une valeur située dans l’intervalle « embonpoint ».En complément à l’IMC, la mesure du tour de taille permet d’évaluer la distribution de la graisse sur le corps. La graisse au niveau de l’abdomen est liée à des risques pour la santé, tels que les maladies du cœur et le diabète. Ce type de gras est plus dommageable, car il entoure les organes vitaux. Une diminution du tour de taille est plus significative pour améliorer la santé qu’une diminution du poids sur le pèse-personne. Mesures du tour de taille représentant un risque élevé pour la santé Pays d’origineHommeFemmeCanada, États-Unis> ou = 102 cm> ou = 88 cmEurope, Afrique subsaharienne, Moyen-Orient, Méditerranée> ou = 94 cm> ou = 80 cmAsie, Japon, Amérique centrale et du sud> ou = 90 cm> ou = 80 cm Source : Diabetes Canada 2018 Clinical Practice Guidelines for the Prevention and Management of Diabetes in Canada. Recherche et rédaction : Cynthia Chaput, Dt.P., Diététiste/Nutritionniste Juin 2014 (mise à jour Janvier 2019)"]
        },
        {
            "tag": "gastroenterite",
            "patterns": ["Que faire en présence d’une gastroentérite ?"],
            "responses": ["Mesurez votre glycémie plus fréquemment et si vous prenez de l’insuline, vous devrez peut-être ajuster la dose d’insuline que vous vous injectez (selon les ajustements recommandés par le médecin pour les jours de maladie).Adaptez votre alimentation : s’il est difficile de manger des aliments solides, tentez de consommer la quantité habituelle de glucides sous forme liquide, ou du moins, comblez les besoins minimaux en glucides du corps qui sont de 150 g par jour lors de journées de maladie.Si vous souffrez de déshydratation (p. ex. vomissements, diarrhée ou fièvre), certains médicaments peuvent aggraver votre fonction rénale ou causer des effets indésirables. Donc, en cas de maladie ou si vous êtes incapable de boire suffisamment pour rester hydraté, vous devriezCESSER TEMPORAIREMENTde prendre certains médicaments pour le diabète, la tension artérielle et le coeur, ainsi que les médicaments diurétiques (qui éliminent l’eau) et les anti-inflammatoires non stéroïdiens (pour la douleur). CLIQUEZ ICI POUR LA LISTE DES MÉDICAMENTS À CESSER TEMPORAIREMENT Vous pouvez également demander à votre pharmacien quels médicaments vous devezCESSER TEMPORAIREMENTsi : Vous mangez moins que d’habitudeVous êtes déshydraté(e) QUAND RECOMMENCER VOS MÉDICAMENTS? Lorsque votre état s’améliore, généralement 48 h après un épisode de gastroentérite, et que vous pouvez reprendre une hydratation et une alimentation normale."]
        },
        {
            "tag": "deshydratation",
            "patterns": ["Quels sont les signes de déshydratation?"],
            "responses": ["Déshydratation légère à modéréeDéshydratation sévèreBouche sèche et pâteuseFatigue et somnolence inhabituellesPeau sèche et froideMal de têteÉtourdissements et vertiges légersSoif intenseAgitation, irritabilité, désorientationRegard terne et yeux enfoncésPression artérielle basseApparition d’un pli cutanéPouls et respiration plus rapidesUrine foncée en petite quantité"]
        },
        {
            "tag": "consult",
            "patterns": ["Quand consulter un médecin ou se rendre à l’urgence?"],
            "responses": ["Il y a présence de signes de déshydratation sévère;Aucune urine pendant plus de 12 heures;La glycémie est supérieure à 25 mmol/L avec somnolence excessive (diabète de type 2) ou à 20 mmol/L avec présence decorps cétoniquesmoyens à forts dans l’urine ou dans le sang (diabète de type 1);Les vomissements sont continuels avec une incapacité à boire;La fièvre est supérieure à 38,5 °C (101,3 °F) pendant plus de 48 heures;Les diarrhées persistent durant plus de 24 h ou plus de 5 fois par jour."]
        },
        {
            "tag": "advises_deshydration",
            "patterns": ["Conseils pour éviter la déshydratation", "Comment éviter la déshydratation", "Comment prévenir la déshydratation"],
            "responses": ["Voici une proposition d’alimentation en trois phases pour éviter la déshydratation et pour mettre l’intestin au repos afin de diminuer la diarrhée et les vomissements. Phase 1Alimentation liquide pour les 24 premières heuresPhase 2Alimentation faible en résidus pour laisser l’intestin au reposPhase 3Retour à une alimentation normaleQuoi choisir?·  Liquides faciles à digérer : p. ex. eau, bouillon à volonté ou autre liquide sans glucides.·  S’ils sont bien tolérés, intégrer des liquides contenant des glucides : p. ex. jus et boisson gazeuse régulière ou des solutions de réhydratation (p. ex. GatoradeMC)À quelle fréquence?·  Boire une boisson de réhydratation fournissant entre 10 et 15 g de glucides / 250 ml toutes les heures.·  Si le liquide est mal toléré, prendre de petites quantités aux 15 minutes pour totaliser au moins 15 g de glucides au bout d’une heure.Quoi choisir?·  Aliments solides (faibles en fibres) à ajouter graduellement (p. ex. pain blanc, biscottes, riz blanc) afin d’atteindre la quantité de glucides de son plan alimentaire·  Introduire progressivement fruits, légumes et viandes selon la tolérance.Quoi choisir?· Attention aux aliments qui peuvent donner des gaz : maïs, légumineuses, chou, oignon, ail, légumes en crudités.· Attention aux aliments irritants : fritures, épices, chocolat, café, cola.·  Réintégrer graduellement les produits laitiers."]
        },
        {
            "tag": "days_to_take_insulin",
            "patterns": ["Les jours de maladie lorsqu’on prend de l’insuline", "Quels jours pour prendre de l'insuline", "Comment prendre de l'insuline lorsqu'on est malade"],
            "responses": ["Chez la personne diabétique, les besoins quotidiens en insuline sont le plus souvent augmentés en cas de maladie. Ainsi, même si la personne diabétique s’alimente sensiblement moins durant les jours de maladie, elle doit continuer à prendre son insuline selon les doses habituelles prescrites ou l’ajuster, selon les recommandations de son médecin. Il est pertinent de prévoir avec son équipe de soins un plan d’action pour les jours de maladie."]
        },
        {
            "tag": "advises_glycemie",
            "patterns": ["Conseils et ajustements", "Conseils pour suivre glycémie"],
            "responses": ["Mesurez votre glycémie plus souvent : toutes les 2-4 heures ou plus souvent, si nécessaire.Prenez votre insuline ou votre médication comme à l’habitude, à moins d’indication contraire du médecin.Mesurez votre température corporelle : au besoin, prenez de l’acétaminophène pour abaisser la température et prévenir la déshydratation par transpiration causée par la fièvre.Personne diabétique de type 1 : si votre glycémie est supérieure à 14,0 mmol/L, mesurez les corps cétoniques dans le sang ou l’urine toutes les 2 à 4 h ou plus souvent, si nécessaire."]
        },
        {
            "tag": "alimentation",
            "patterns": ["Alimentation"],
            "responses": ["Si votre appétit diminue, tournez-vous vers des sources de glucides liquides ou semi-liquides (compote de fruits, yogourt, etc.), à raison de 15 g de glucides par heure si vous avez pris les doses adéquates d’insuline."]
        },
        {
            "tag": "hydratation",
            "patterns": [
                "Hydratation", "Hydratation et diabète", "Comment s'hydrater", "Comment s'hydrater lorsqu'on est malade"],
            "responses": ["Si la glycémie est plutôt élevée, buvez beaucoup de liquide sous forme de boissons non sucrées (eau gazéifiée, boisson gazeuse diète, bouillon, etc.) afin d’éviter la déshydratation, à raison de 250 ml chaque heure. Si la glycémie tend à diminuer, buvez de petites quantités à la fois d’aliments sucrés (jus de fruits, Jell-OMCrégulier, lait, etc.)."]
        },
        {
            "tag": "emergency",
            "patterns": ["Quand contacter un médecin", "Quand se rendre à l'urgence", "Quand consulter un médecin"],
            "responses": ["Contactez un médecin ou rendez-vous à l’urgence en cas de : Glycémie supérieure à 20 mmol/L avec présence de corps cétoniques (moyen à fort) — diabète type 1Glycémie supérieure à 25 mmol/L et somnolence excessive — diabète type 2Vomissements continuels et incapacité de boireFièvre supérieure à 38,5 ºC (101,3 ºF) pendant plus de 48 heures"]
        },
        {
            "tag": "How_to_treat",
            "patterns": ["Comment se soigner?", "Comment traiter la gastroentérite?", "Comment traiter la déshydratation?"],
            "responses": ["Consultez un pharmacien avant d’utiliser des médicaments en vente libre pour traiter une maladie, afin de vous assurer qu’il n’y a pas de contre-indications pour une personne diabétique. Les antitussifs, les expectorants et l’acétaminophène n’ont pas d’effet sur la glycémie. Pour soulager les symptômes du rhume ou de la grippe, en plus du repos et d’une bonne hydratation, choisissez des pastilles sans sucre pour soigner un mal de gorge et une solution saline pour un nez bloqué. Les décongestionnants sont à déconseiller puisqu’ils peuvent affecter la glycémie."]
        },
        {
            "tag": "Insulin_conversation",
            "patterns": [
                "Conversation de l’insuline", "Commenr conserver l'insuline"],
            "responses": ["L’insuline ouverte peut supporter unetempérature ambiante(entre 0 °C et 30 °C) pendant environ un mois après ouverture. Ainsi, vous n’avez pas besoin de la maintenir au réfrigérateur en tout temps. Il faut cependant éviter les températures extrêmes. Pour l’insuline non ouverte ou en cas de situation particulière, il existe également des pochettes isothermes pour maintenir l’insuline au frais."]
        },
        {
            "tag": "risk_fasting",
            "patterns": [
                "Jeûne et diabète : une combinaison présentant des risques", "Risques associés au jeûne", "Risques du jeûne"],
            "responses": ["Les principaux risques associés au jeûne sont : l’hypoglycémie, l’hyperglycémie, la cétose diabétique (présence de corps cétoniques dans le sang) et la déshydratation. Les personnes vivant avec le diabète traitées avec de l’insuline ou des sécrétagogues d’insuline* sont particulièrement à risque. Il en va de même pour les personnes ayant un contrôle inadéquat de la glycémie, celles présentant des épisodes d’hypoglycémie fréquents et/ou ayant eu un épisode d’hypoglycémie sévère dans les 3 derniers mois et celles ne ressentant plus les symptômes d’hypoglycémie. La présence de complications et de maladies aigües ainsi que certaines situations particulières (ex. : métier physique) accroissent aussi les risques associés au jeûne. *gliclazide (DiamicronMDet Diamicron MRMD), glimépiride (AmarylMD), glyburide (DiabetaMD), répaglinide (GlucoNormMD). Afin que le jeûne soit fait en toute sécurité, il est primordial de le planifier avec son médecin."]
        },
        {
            "tag": "habits",
            "patterns": [
                "Maintenir de saines habitudes de vie", "Habitudes de vie saines", "Conseils pour maintenir de saines habitudes de vie"],
            "responses": ["Au-delà du jeûne quotidien, le Ramadan entraîne une perturbation drastique des habitudes de vie, particulièrement en lien avec l’alimentation et l’horaire de sommeil. Ces changements affectent de façon importante la gestion de la maladie et certains conseils sont de mise."]
        },
        {
            "tag": "breaking_fast",
            "patterns": ["Rompre le jeûne", "Comment rompre le jeûne", "Comment rompre le jeûne en toute sécurité"],
            "responses": ["Une personne vivant avec le diabète qui décide de pratiquer le jeûne du Ramadan doit savoir que certaines situations pourraient l’obliger à rompre le jeûne. C’est le cas si unehypoglycémie(glycémie en bas de 4,0 mmol/L) ou unehyperglycémieimportante (glycémie en haut de 16,5 mmol/L) surviennent. Pour télécharger une version en arabe de ce texte,cliquez ici. Lorsque le jeûne est rompu : Garder un horaire stable pour les repas.Éviter le grignotage continu.Consommer desrepas équilibrés.Boire beaucoup d’eau.Lors du Sahour (repas avant le lever du soleil), privilégier les aliments contenant des glucides à absorption lente (harira, semoule, haricots, pain, riz, dhal).Lors de l’Iftar (repas à la rupture du jeûne), débuter par des aliments contenant des glucides à absorption rapide (fruits, dattes) puis consommer des aliments contenant des glucides à absorption lente." ]
        },
        {
            "tag": "possible_risks",
            "patterns": ["Les risques et complications possibles", "Quels sont les possibles risques", "Quelles sont les complications possibles"],
            "responses": ["Les femmes diabétiques sont plus à risque de fausse-couche ou d’avoir un bébé avec des malformations congénitales (malformations cardiaques et rénales par exemple). Ce risque augmente considérablement si le contrôle de la glycémie n’est pas optimal, surtout au moment de la conception et durant les 3 premiers mois de la grossesse, moment où se forment les organes du bébé. En cas de glycémies mal contrôlées, il est fortement conseillé de retarder la grossesse. Votre équipe de soins pourra vous aider dans votre démarche pour améliorer le contrôle de votre glycémie. Une glycémie mal contrôlée présente de nombreux risques pour la mère et le bébé."]
        },
        {
            "tag": "hormones",
            "patterns": ["L’impact des hormones sur la gestion du diabète", "Quel est l'impact des hormones sur la gestion du diabète?", "Hormones et diabète", "Hormones et glycémie"],
            "responses": ["Les changements hormonaux de la puberté influencent le contrôle de la glycémie, le rendant souvent plus difficile. L’action de l’insuline diminue d’environ 30 à 50% en raison des hormones de croissance et des hormones sexuelles qui créent une résistance à l’insuline.  Chez l’enfant non diabétique, le pancréas compense cette résistance en sécrétant plus d’insuline. Chez la majorité des adolescents diabétiques, il faudra constamment ajuster les doses d’insuline injectée pour maintenir un contrôle adéquat de la glycémie. À la fin de la puberté, les besoins redeviennent habituellement semblables à ce qu’ils étaient avant celle-ci. L’effet de ces hormones est parfois plus marqué vers la fin de la nuit. Ainsi, on remarquera souvent en premier lieu que la glycémie du matin est anormalement élevée."]
        },
        {
            "tag": "menstruations",
            "patterns": ["Les menstruations", "Menstruations et glycémie", "Menstruations et diabète", "Quel est l'impact des menstruations sur la glycémie?", "Quel est l'impact des menstruations sur le diabète?"],
            "responses": ["Chez certaines femmes diabétiques, la glycémie varie au cours du cycle menstruel, un effet également attribuable aux hormones. Plusieurs remarquent une hausse de la glycémie quelques jours avant les menstruations et une baisse lors des premiers jours des menstruations, les rendant plus sujettes aux hypoglycémies."]
        }
    ]
}